{
  "main_blog": [
    {
      "id": "birthdays",
      "title": "Birthdays: Why I Hate Them",
      "date": "2018-12-22",
      "img": "https://images.unsplash.com/photo-1530103862676-de8c9debad1d?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1740&q=80",
      "img_position": "0 17%",
      "img_credit": "Adi Goldstein on Unsplash.com",
      "indent": true,
      "content": [
        "Mainly two reasons. One I guess is more negative than the rest (although I guess they could both be considered negative), but I guess what's more important is that they're true. I'm not trying to be negative, it's just how I feel.",
        "First is, they are always hyped up so much. Because of this, you anticipate it to be a really good day for you and so when it doesn't live up to that expectation (which it never does for me), it makes you feel bad about yourself. I understand some people get big celebrations and are really cared for, so their family and friends go all out for them and make it a big day, but I've never had an experience like that and I've never felt special on my birthday. Everyone makes it seem like you're supposed to and that happens for a lot of people, so when that doesn't happen (which it never does for me), it just feels sad and disappointing. I guess every time my birthday comes around, it just reminds of how much I don't matter and how hardly anyone cares about me. Then I just feel sad and depressed the whole day, which makes me angry. Angry that this is my life and that I feel that way on a day that's supposed to be special to me and then just angry that I even have a birthday.",
        "Which brings me to my second reason. A birthday is to celebrate how long you have been alive and I hate being alive. Life sucks and the world we live in sucks and I wish I could just die (like I said, it sounds like I'm just being negative, but it's how I feel). I don't find any reason in celebrating something that sucks. I never feel happy anymore, so what's there to celebrate about my life?",
        "If other people cared more about celebrating me though, maybe I wouldn't feel like life sucks so much and could actually enjoy a birthday for once. But this never happens. So yeah…..birthdays have become a day that I despise. Every time the word “birthday” comes up, there's automatically so much sadness and anger associated with it for me. To try and lessen these feelings on my birthday, I don't attempt to celebrate or even tell people my birthdate anymore. It's just any other day (which it really is). One of the worst feelings is letdown – feeling happy and excited about something, but then things turn out the exact opposite. You feel crushed. When I was young and looked forward to my birthday and invited the few people that I knew over to “celebrate”, it always ended up feeling very underwhelming, especially when comparing it to how other people's birthdays that I know go. So, I'm trying to protect myself from any deeper mental pain. If the date doesn't matter to anyone else, then it shouldn't matter to me either."
      ]
    },
    {
      "id": "i-want-to-say",
      "title": "I want to say...",
      "date": "2020-01-22",
      "img": "https://images.unsplash.com/photo-1516585427167-9f4af9627e6c?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1160&q=80",
      "img_position": "0 40%",
      "img_credit": "Kat J on Unsplash.com",
      "indent": false,
      "content": [
        "I want to say that I feel sad and angry all the time.",
        "I want to say that I feel like I'm not special to anyone. No one needs me, people just use me when they are lonely or bored but don't care about me otherwise.",
        "I want to say that it hurts me knowing that my siblings and all my nieces and nephews will never need me because they never grew up with me. I was never there so they know how to get on without me and it doesn't matter if I'm there now or not.",
        "I want to say that just because even though I never say it verbally and try not to show it, I need you. I hate being ignored or going unnoticed. I need you to see me and act like I matter to you.",
        "I want to say that I want to focus more on my depression than my anxiety because I feel like the anxiety is mostly coming from the depression, not the other way around&hellip;but they are the doctors.",
        "I want to say that I feel sad when you don't answer my texts or respond to my messages. I feel like I'm not that important to you.",
        "I want to say that I really don't know how you can help, but pls don't leave me alone and don't just tell me that you're there for me. I won't take initiative even if it's what I need, and it feels better to know that I'm on someone's mind.",
        "I want to say that I wanna know more about my dad. What he looked like, what his name was. I wanna know how I came about and why.",
        "I want to say that I hate myself and I wish I could be pretty or feel like I fit in and feel wanted and like I belong. I wish I could be good at something other than being a failure.",
        "I want to say that I'm afraid that some of my family secretly hates me because I'm in their life and I wasn't supposed to be. I didn't ask to be here, and I wish I wasn't.",
        "I want to say that God or the higher being of this earth hates me and I think I'm cursed and won't ever be happy. I've just been stuck in this for so long.",
        "I want to say that I don't see a future for myself. If someone asked me where I see myself in five years, my answer is I think I will be dead by then.",
        "I want to say that I'm jealous of you because you have a lot of friends and a lot of people who love to show that they care about you and would never forget you. You are pretty and smart and have people that depend on you, allowing you to be confident. You just fit in in this populous world because of how you grew up and your traits and genetics. You are one of the people that get to be truly blessed. You get to be happy and love life.",
        "I want to say that I don't like to hope anymore because I used to but was always let down and the pain would hurt me harder each time. It's like having the ground pulled out from under you after you feel like you just climbed a lot of stairs, and now, you're below square 1 if it's even possible – it is.",
        "I want to say that I don't feel like your family is my family and maybe that's messed up, but we have nothing in common and I have a whole other family out there who is a lot more like me that I wish I could have grown up with and I miss them. You're my family, but your family isn't. Maybe I'm just lost.",
        "I want to say that I'm sorry that I can't be who I'm supposed to be or who you thought I would be. I'm sorry that I'm not good enough. I'm just not capable. I never was. I know I'm a failure and that I'm disappointing.",
        "I want to say that I've never felt comfortable in my own skin. I've always felt ashamed of myself for being alive and being here or there.",
        "I want to say that I'm scared that I'm gonna be alone and feeling all this sadness, self-hatred and anger forever. I can't even imagine seeing a light in all this darkness anymore because it's been so long and it has never come.",
        "I want to say that I'm sorry for being a bad kid and a bad friend and I wish that I could erase so much.",
        "I want to say that I don't think I can ever love myself if I don't feel like anyone loves me. If I don't deserve other's love, why should I deserve my own? If no one can love me, how can I?",
        "I want to say that I don't know who I am or what I'm doing here. I really have no plans. I'm super lost.",
        "I want to say that I love people who are genuine and aren't afraid of what people think of them, they are just themselves whatever that is. I never wanna discriminate or leave anyone behind. I don't want anyone to feel how I feel, I wanna uplift people and make them feel comfortable and supported and less judged.",
        "I want to say that I think about you all the time and I wonder if you do the same. But I know you don't.",
        "I want to say thank you for being one of the only ones who have ever noticed me and pls don't ever leave me. I care about that and you more than you know.",
        "I want to say that I wish you needed, appreciated and paid attention to me as much as I do you.",
        "I want to say that I'm scared of people hating me because I'm already so lonely. I'll do anything to be liked and accepted.",
        "I want to say that I want to go to a rage room and let everything out. A lot of the time I just want to punch the wall as hard as I can or throw everything off my desk and yell…but I'm too scared.",
        "I want to say that I feel trapped in everything and I don't think any therapy, counseling or medication can help. I feel helpless and hopeless.",
        "I want to say that I live my life in fear and anxiety. Everything I ever do is out of fear, every decision I make. Idk how to be comfortable because I've never felt like that.",
        "I want to say that I'm adopted, and I feel isolated from other Black people and like they think I don't belong with them. I don't know how to be “black” because I never got to grow up with that experience, but I wish I did.",
        "I want to apologize to all the Black people if they feel like I'm letting them down or like I'm a disappointment.",
        "I want to say that even though I'm gay and quiet and wear boys clothing, I'm still a girl and you can talk to me and trust me, you don't have to treat me like you treat all the guys you know. It hurts when you do things to your other female friends but not to me because I know it means that you see me as different somehow and I'm just insecure but that's all.",
        "I want to say that I cry just about every week and I haven't been happy in a very long time.",
        "I want to say that I feel like I don't deserve to be rid of my depression because I feel like I'm just a bad person who is not supposed to be here. If not, then maybe God or any higher being would be watching over me and guide me to people who I belong with who love me. If I can never fit in and am always alone, then something must be wrong with me that I deserve punishing for.",
        "I want to say that I want to die before you do because I don't want to see you die.",
        "I want to say that I feel like my depression and anxiety are fighting each other and whichever one wins, either way, I lose.",
        "I want to say that I don't want to lose you and that even if I leave here or move somewhere else, I want you to stay in touch with me. I'm not trying to leave you because you're one of the only lights in my life. I just can't stay here feeling like this forever.",
        "I want to say that I don't want to hide things from you because I don't want you to feel like I don't trust you. But idk how I can trust anyone with all this.",
        "I want to say that I'm sorry if you find me annoying. I don't mean to be, I just wanna mind my own business and let you do the same. I don't wanna be a bother.",
        "I want to say that I'm mad at you for leaving me. You used me and then when things got better for you, you left and never came back. Now I never wanna talk to you again bc you hurt me too much and how am I supposed to appreciate you after that? But I guess you don't care if I talk to you or not anyway.",
        "I want to say that I'm not who or what you think I am. I am much weaker. I am sensitive. I am very emotional and think a lot and about too much. I try to please everyone, and I get scared or feel like a failure when I feel like people don't like me or feel like I hurt someone. I can't control my feelings at all or my shyness and anxiety.",
        "I want to say that even though I'm funny and I like to make you laugh doesn't mean that I'm a happy person who is never serious and has no care in the world. Being funny is the only way I know how to get people to notice me because I'm nothing. It masks my insecurities and it also makes me feel good and like people enjoy me when I'm around. But I'm really a mess inside, I'm not laughing when you're gone.",
        "I want to say that I hate life and I hate school and this earth and how the world works. Everything is messed up…some people feast while others starve, and bad things happen to good people and some bad people get away with really messed up things. This world is a horrible place and I wanna leave. I don't feel like I will ever be happy.",
        "I want to say that I want to kill myself. I want to get drunk and jump off a really high building or shoot myself because I don't believe things will ever look up for me. I think suicide is my destiny. I've never been anything my whole life and idk how I could ever be something.",
        "I want to say that I'm okay with dying and it's what I really want bc I feel like it's the best thing that could happen to me. It's better to me to not be here than to be here always lonely and wishing I could be someone else. It hurts way too much.",
        "I think all this constantly, but don't say it, because I'm scared that if I say anything you will dismiss my feelings or think I'm selfish, foolish or ungrateful of what I do have and not care about how I feel.",
        "I'm scared you consider me as a burden for you and leave me. I don't want to spill everything to someone who is not truly there or doesn't really care.",
        "I'm scared of just getting more hurt. So, I just remain lost and stuck in this endless mess.",
        "I really want to find a way to end my life somehow.",
        "I must."
      ]
    },
    {
      "id": "the-n-word",
      "title": "The 'N-Word': Is It Okay to Use? 🤔",
      "date": "2019-11-24",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/-10_JIm_CRow_POster.jpg/780px--10_JIm_CRow_POster.jpg?20210106200237",
      "img_position": "0 40%",
      "img_credit": "Wikipedia Commons",
      "indent": true,
      "content": [
        "A common argument in our society for decades has been whether it’s okay to say the “N-word”, another known as “n*gga,” and if so, who can say it? Many people have their opinions on the word, but here’s my spiel. I don’t use the word a lot, but I understand the people who do, and I believe that when said by the right people, black people, it is appropriate.",
        "As a child around a lot of white people, I never used to use the word because I knew all my friends couldn’t, and I would even notice that several white people I knew would get offended when the word was used.  But as I got later into secondary school, I started trying to fit in with my culture after feeling a bit stripped from it by adoption; I started looking up to more black people. There would be people who I admire using the word and I began learning more educated reasons as to why the word makes sense for the black community to use in conversation to each other and thus came newfound respect I have for the word.",
        "I think the first and most important thing to understand is that the word means something completely different depending on who says it. It is a racial slur, but when black people say it to each other it does not mean the same thing as when other races say it towards black people (or any race for that matter) and there is a reason for that. For black people, the word is basically another way of saying “black brother.” Black folks are a family/community who have been through oppression together and still deal with ongoing discrimination and the aftermaths of slavery and Jim Crow Laws. The word is part of our culture because it was a word specifically targeted at black people and defined us and how we were treated for so long; it belongs to us as it was made to describe specifically us. When we use the word with each other, we are accepting our blackness and are proud of it. We are uniting each other with this word because it applies to all of us. Because the word was used towards black people, they are the only people who can reclaim it. If you are not part of the black culture, you have no right using the word, as it is the difference between the oppressed and the oppressor. To indirectly quote a reading I once read, there is an imbalance of power in our society so when someone not on the same level of power as a black person (which would be anyone who is not black) uses the word, they are reinforcing the imbalance. The word can never have racist intentions when one black person says it to another because we are on the same level in society.",
        "I think of it as like the same idea as, for example, the curse/pejorative word “b*tch.” It was originally always perceived as offensive until many female friends started calling each other it as a way of acknowledging each other. It is not seen as rude when said to one another because they are both females (and of course as with any word, it matters how one delivers the word too). If a male said, “that’s my b*tch,” it would likely feel more attacking to the females around than appropriate. Males have a different (more specifically, higher) level of power than women so when they use that slur towards women, it typically deems offensive, however, they put the word. Another example would be d*ke (a derogatory term for homosexual women). Many lesbian clubs use the word to describe themselves and you may see lesbian women holding signs up with the word at pride parades, but if you don’t identify in that group, you have no place saying that word. A third example would be “pussy”, which is demeaning word for a women’s vagina, although, at a Women’s March, you will likely see a lot of women wearing hats with cat ears alike a “pussycat”, to come together and say “we are women with pride” in a symbolistic way.",
        "Of course, it is ideal that no race, gender, religion, sexual orientation, etc. are treated superior to another, but unfortunately, it’s how our society is. We continue to fight this, but these offensive words have been formed and will always have their meanings. The only people who can ever reclaim these words are the people who they are “supposed” to define, because they are all on the same level in that category, thus the word can’t be offensive when calling each other it. It would be like making fun of someone because they got an F on a test when you got an F as well. You two would be in the same boat, therefore, your insults wouldn’t anymore more condemning to them as they are to you. If the community as a whole does not find the reclaim of the word to each other offensive, then using the word among each other isn’t condemning at all.",
        "The N-word is used a lot in music these days and I have similar thoughts towards that as well. The genres the word is typically used in, hip-hop/rap and R&B, were both originated from black people. It is our music. We should be allowed to use our own language, our own cultural vocabulary, in our own music. Other races/ethnicities can listen to our music if they wish, of course, but listening to the music does not admit them into the culture. If the word does not belong to your culture and is considered derogatory when people of your culture use it (which is everyone but black people), you should not use it, and moreover, should not want to use it. As Amanda Seales said on The Real, “why do non-black people want to use the N-word so much?!” Seriously, why? If it’s not your word to use, then why do you want to use it? There are many derogatory words for other races that I know yall don’t want to hear directed towards you by someone can’t relate, so what’s special to yall about this one?? It reminds me of the famous quote, “Everyone wants to be black until it’s time to be black….” Anyways, it’s easy to skip over words when you’re listening to them. @Tiffanydee on YouTube said “’[if] people [didn’t] put it in songs then it wouldn’t be said,’” is the equivalent to ‘[if] women [didn’t] wear such revealing clothes then they wouldn’t have problems.’ If people would just control themselves THEN it wouldn’t be a problem.” If you’re gonna chose to listen to a certain community’s music, it only makes sense to respect the community. Otherwise, find other music.",
        "What I have never really understood is why other races, especially white people, dislike when black people use the word. Once when I was at a sleepover for my church youth group, the youth group leaders (white people) noted we could play music with cuss words in it, but not the N-word. If they had said, “no cuss words at all,” I would understand, but simply just limiting the N-word, why? It’s just music. It’s music from my community. It’s our word, it’s our community, why do you care? How and why does it concern you? We have the right to reclaim it and we as a community decided to and turn it into something powerful for us, you don’t get a say in that. I don’t believe that people of other races should get to regulate the use of the N-word. That would be like males regulating the word “b*tch.” They don’t get to decide when it’s appropriate for women to say it because that word doesn’t concern them. It’s not part of their community and is not meant for them. Now, I don’t mean to bash the youth group leaders, I’m sure they were just trying to make the place a “safe environment,” but when making that sort of call, they are excluding a lot of my community’s music/genre and for no reason. They could have just asked the black people in the room (two people: my brother and I) how we felt about the word and then go from there instead of calling the shots on something that’s not theirs to control.",
        "One last thing it doesn’t hurt to point out/remind. The reclaim of the N-word is not the same as the original word. I see people talking about how “that word doesn’t belong to black culture, it belongs to slavery culture...” Um excuse me, but first, the word literally means “BLACK,” not “SLAVE”. If the word is used to categorize a certain group of people, then it is their word because it is used to describe them, not anyone else. It is only associated with that group of people/that culture. So, it most definitely is a black culture word. Second, who are you to tell us that a word we made up is not ours to use and doesn’t belong to our culture? We made up a word that ends in “-A”. The original word ends in “-ER.” Needless to say, those are, therefore, different words. We don’t use the “-ER” word (although, if we did, I still wouldn’t believe it was a problem as long as it was collectively reclaimed). We call each other a word that we, black people, made up for ourselves to turn a demeaning term into an empowering and uniting one; to say “yes, I am black and my “black family” and I are accepting and proud of this. So you won’t see any of us going around calling each other the “-EP” ending word so no reason to get all up your ass about whose word is whose. We use what we recreated."
      ]
    }
  ],
  "dance_blog": [
    {
      "id": "stuck-vs-fikshun",
      "title": "Stuck vs Fikshun: Unnecessary Drama",
      "date": "2021-04-20",
      "img": "https://images.unsplash.com/photo-1611435263641-4656c4b188c3?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1625&q=80",
      "img_position": "0 40%",
      "img_credit": "Anna Frizen on Unsplash",
      "indent": true,
      "content": [
        "So, I just re-watched the Stuck vs Fik-Shun Turfinc / Greathouse Dance battle, and here are my thoughts: First, lemme just say that I don’t really have an opinion on who won. Both sides were kinda stale for me and I think the music choices had a lot to do with it. Fik-Shun came with more energy but Stuck had this swag that hyped the audience up that I liked. So, idk who won, and frankly, I don’t really care. I’m here to talk about the unnecessary drama during that battle. It’s not a lot like it didn’t become that big of a thing, but I still just wanted to put my 2 cents out there.",
        "To me, it looked as if when Stuck grabbed Fik-Shun during the battle, he was just trying to do a little smth to go with the beat as retaliation for Fik-Shun continually grabbing his hair and shirt and touching him throughout the battle. Then they accidentally went down together. I think that Stuck was just in the moment doing smth for battle effect and it understandably got perceived wrong. Stuck was not tryna choke Fik-Shun, just play with the beat.",
        "Ever heard of the Fundamental Attribution Error theory? It’s a psychology term. It’s a theory that people tend to attribute other people’s mistakes to dispositional faults more than to situational faults. You under-emphasize what a situation might have had to do with something and assume the worst of the person. I feel like people are quick to assume the worst of Stuck when it really looks like Stuck never wanted any of this heat. Now ofc I wasn’t there and idk Stuck or Fik-Shun personally so I have no way of knowing everything that went down and what their interactions were like with each other before, during and/or after the battle, but what I do know is that everybody makes mistakes. We all do things we regret. Dunno if this has ever happened to you, but it happens to me ALL the time where I’m trying to tell someone smth and am having a hard time figuring out which words to use and then I say smth that I immediately realize is gonna make the person think I’m saying smth that I’m not trying to say. I’m not good with words at all and am constantly trying to find the rights words to convey my thoughts but struggle and end up saying things I don’t mean to say. But obviously, I can’t take it back; the words already came out. This is how I’m seeing the situation with Stuck and Fik-Shun. It felt like Stuck had this idea to put his arm around Fik-Shun's neck and hit the beat as like some little battle fun but afterward realized that the move could be perceived badly and regretted it. On Instagram, Stuck says that he apologized to Fik-Shun afterward and that he was just in the moment when it happened. I don’t believe that’s a lie. It’s clear to me Stuck wasn’t trying to choke Fik-Shun bc when he grabbed Fik-Shun, he was hitting the beats. Then, after that round, Stuck goes up to Fik-Shun and says smth that we can’t hear, but it looks clear that it wasn’t anything like “you’re a pathetic cunt and I hope you die in Hell” haha. It looked more like some kind of peace offering like an apology or smth to let Fik-Shun know he wasn’t trying to escalate anything there.",
        "Idk much about Stuck, I’ve seen him a few times in videos n’ pics with Kida and that’s about the extent for me. I’ve watched a lot more of Fik-Shun than I have of Stuck. But from what I was observing earlier on Instagram, Stuck doesn’t seem like a drama-seeker. He seems pretty chill, he’s a father who looks like he does great with his family and despite Fik-Shun's attempt to turn the dance battle world against him, he’s been very grounded and mature about the whole situation. During the battle, Fik-Shun looks like he has a chip on his shoulder against Stuck since the beginning. Fik-Shun called him out for this battle from what I understand, and Fik-Shun looked like he was just waiting for opportunities to throw hands at any point. Stuck was chill, keeping a smile on his face when Fik-Shun showed aggressiveness towards him and looked like he was trying to dap Fik-Shun up after the battle. I saw him offer a fist bump near the end too. Just from every pov that I see Stuck in, he looks like he’s not a guy who wants beef, he’s a grown-ass man doing grown-ass things. Fik-Shun is the one who was doing all this touching even when apparently Stuck told Fik-Shun that he didn’t like all that. So, I can’t cut out Stuck as the bad guy here. I know that when I make mistakes, I hope that people understand that I made a mistake and that I’m sorry instead of just assuming the worst out of me bc I don’t feel like I’m a terrible person overall and don’t wanna be perceived that way. So, I wanna do the same for others: realize when they might have just had a bad moment rather than gaining up on them for small mistakes. God knows we need more people lifting each other up in this world than bringing each other down.",
        "I can’t lie, I feel I lost a bit of respect for Fik-Shun after seeing how he reacted. Like I understand being pissed that someone put you in a headlock for a few seconds, but low-key trying to pit everyone you know against Stuck for that is just messed up, especially considering that Stuck apologized right afterward and was not tryna pick a fight with you. It’s unnecessary drama (I guess when is drama ever necessary tho...) and generates people to have beef with others they don’t even know. It does seem like drama seems to follow Fik-Shun, so I wonder what that says about him 👀"
      ]
    },
    {
      "id": "bailey-and-kida-2",
      "title": "Bailey x Kida: Welp, I was right...",
      "date": "2020-06-13",
      "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR-RjunbIq26mz0Eu5gTmYoprt1ix8nbiVjfA&usqp=CAU",
      "img_position": "0 25%",
      "img_credit": "Instagram video",
      "indent": true,
      "content": [
        "Welp, World of Dance NBC has started airing, and I was right…. the viewers really are trying to split up Bailey & Kida (BK). It really sucks bc the two trust each other so much and have made a great friendship together, but so many of their so-called “fans” refuse to support it. It’s heartbreaking to me seeing so many comments only praising one of them and even some trying to put one of the two down. Like, why? They are a TEAM and would love most for you to treat them as one. They need our support to prosper, but “fans” just don’t want em to prosper. The amount of comments on the channel saying that one of them (or both of them) should have competed by themselves is high.",
        "It seems to me there are 3 main different kinds of haters for this duo that are everywhere under the videos they have together.",
        "1. The people who think Kida is better and should have competed alone.",
        "2. The people who think Bailey is better and should have competed alone. [The biggest mass of haters there].",
        "3. The people who think Sean & Kaycee are better (and the “best”) and want to bring BK down bc of fear that people are gonna like them better than they do Sean & Kaycee.",
        "Seemingly, there are about the same number of haters as there are people who support them as a duo in the comments. There definitely are quite a lot of people dividing the two, and as I predicted before, most of them are Bailey fans. What irks me more about this is one of Bailey’s fans had the nerve to call all of Kida’s fans “rude” before, yet Bailey’s fans are the ones demeaning Kida and excluding him the most. I see more Bailey supporters putting Kida down. For instance, some have said “she is soo much better than him lol” and “I don’t get the hype of Kida” and “Bailey should have competed with Kenneth.” On Kida’s side, the supporters just mention Kida, but don’t Bailey. There are some saying Kida should have auditioned by himself, but seemingly not as many as are dissing Kida from Bailey’s end. Although, I will say, that observation may be more attributed to YT than IG. Under @nbcworldofdance’s post of their qualifier, I recall Kida got a lot of the individual attention there, which is just as bumming. I don’t want to contribute by complimenting Kida more or upping him over Bailey, but I almost feel compelled to when I see so many putting him down. I have not been one-upping him, but I have been liking comments that only mention him or are one-upping him, just bc Bailey’s fans are doing that for her while leaving him in the dark. If the situation was reversed, I would do that for her (I even liked a lot of comments solely supporting her on IG when their Qualifiers first came out), but I don’t wanna feel inclined to have to do this for either one of them. I want people to respect them as a duo, and it is upsetting seeing how many can’t seem to do that. I feel bad knowing that one of their feelings could be hurt after viewing so many comments against them or acting as if they are invisible.",
        "I feel like many fans who are hating on the duo are blind to the negative results their suggestions are likely to face.",
        "1. Neither of them competing solo is likely gonna go better for them than competing as a duo.",
        "In all honesty, a urban or hip-hop* soloist is not likely to go very far in the World of Dance competition. There’s only so much one can do by themselves. It is hard to get more creative every round, especially in urban dance because there aren’t many catchy tricks or illusions to create remembrance or uniqueness for one to do other than like a flip or a flare of some sort. In contemporary, for example, a dancer can use emotion or a story to capture the audience, but in urban dancing or even popping and animating, that is not common and most solo performers in those styles seem to not be able to emulate emotion or share a story very well in the style; especially not w/o feeling or being extremely repetitive throughout the competition. Bailey has put emotion into some of her popping and animating performances on WOD, and has done it beautifully and captivatingly, but if one were to watch like all of her 2019 WOD performances back-to-back, they are all pretty similar. She would run out of content to amaze the judges after one or two rounds, when she has just herself. Like imagine if she was paired to duel against Josh and Denise from season 3 or The Lab or Vpeepz [I wanna say “or Charity & Andres,” but they were so uniquely good in their duel round, that it wouldn’t be a fair comparison hah] could beat her out with her Titantic or Midnight choreo [and yes, I’m comparing her as a soloist to groups bc I think that’s how the competition is working this season. They seem to only have 2 categories instead of 4 this time]. Bailey also can’t just fall back into urban dance mode bc that’s not unique enough. She would get nowhere with choreo from like Matt Steffinina, Brian Friedman, Jake Kodish [sorry guys, I love your dances tho]…. It will not be able to compete with what everyone else on the WOD NBC stage is doing. She doesn’t have enough presence to take on that stage herself for much more than 1 or 2 rounds. Sorry hardcore Bailey fans, I know you will argue and find me saying this triggering, I really do, but it is just real. There is also the question of how Bailey solo would do bc I don’t think she’s ever done a big performance or competition on her own. Just small things like single 2 min performances [correct me if I’m wrong].",
        "It’s the same story with Kida but even worse in his case bc he is less versatile than Bailey. I’m skeptical that Kida’s solo choreo would be unique or creative enough. It would likely be repetitive and underwhelming up on that big stage. Plus, his music taste isn’t energetic enough. Kida also gets very nervous I know, and WOD wouldn’t be like SYTYCD where you only dance alone a small bit of the time while most of the time you’re getting mentored, dancing alongside others and being given choreography. On WOD, everything is up to only him. The choreo, the outfits, the performing…it’s a lot of pressure that I’m not sure he would do so well under, especially bc he is much more of a family dancing guy. He thrives with partners and backups. I don’t really think Kida could get further than to the Duels all by himself, even with his insane talent.",
        "The point is Bailey and Kida need each other to succeed in this game. Together, Kida brings the hype, uniqueness and swag, and Bailey brings the creativity and variety. With each other, they can both keep each other in check. Kida gives Bailey a more unique factor so she is not urban with a touch of emotion popping. He brings in another level of skill. Bailey gives Kida the creativity and variety in choreography that he needs, plus could even pull a few non-urban dance tricks sometimes to add extra flare, talent and surprise. Yes, they could use more chemistry, but I am not worried about that. Their opponents should be bc they only grow closer as friends. Together, they are just A LOT more of a threat than alone, and whoever is doubting that, I believe is just sucking Bailey’s titties or Kida’s dick. Fik-Shun and Popping John are arguably the best solo hip-hop dancers out there, and neither of them made it to the Divisional Finals when they competed on WOD NBC. If they can’t, it’s unlikely Kida or Bailey could by themselves [I guess that always depends on the level of their competition tho]. I love BK as individual dancers, but I wanna be realistic -- optimism has never been a strength of mine. If the two aren’t gonna compete together, than they just shouldn’t compete at all bc they stand no chance. That brings me to the next overlooked factor by fans that I’m noticing.",
        "2. Bailey is NOT better off in the competition by partnering with Kenneth San Jose.",
        "I’m gonna quote a YT commenter under their Qualifier video for this one. Dude said to someone who thought Kenneth x Bailey would be better, “that's a very fan-based opinion haha. ken's a lot more showbiz with his dancing in the Philippines lately. Compared to Kida who's still active and much more accomplished in competitions.” I second this. I’m not saying any of this bc I would just rather Kida dance with Bailey [although I would], I’m saying it bc it’s the truth. Kenneth is not unique enough as a dancer. He is just an urban dancer. Kida has unique body control. He can do these insane isolations, his popping is CRAZY clean, he can mimic a song with his body w/o missing a single beat, he is very versatile in hip-hop and he has this natural swag that he can integrate with his technical styles. Bailey’s pops are incredibly hard-hitting, her arms are very flexible, she also has a natural swag, and she is very versatile in and out of hip-hop. Kenneth has none of that. He is a very fluid dancer, he is very good at having chemistry with others, and he is good at choreographing for two; he is a ladies-man. But that is not a standout for World of Dance. There are a lot of better choreographers than him out there in this ladies-man style. He doesn’t have any kind of unique factor, so with him and Bailey together, their dance would be pure chemistry, no special or outstanding element. Just chemistry is not enough; you can’t get far on cuteness. If Bailey partners with Ken, they have to resort to mainly urban choreography bc a team is only as strong as their weakest link, but, again, that’s not enough for this competition, as we have seen repeatedly with urban duos who have tried. Bailey & Kenneth just don’t stand a chance against opponents bc Bailey can’t carry the duo herself, and Kenneth is a performer, not a competitor [and, yes, ik about WOD Philippines. That show is a carbon-copy of this one. It’s like how all the Got Talent shows other than Britain’s and America’s, are just underwhelming and the winners can never really compete with the BGT or AGT finalists. Oh, btw, I hate America]. Kida is mainly a performer as well, but he has shown multiple times that he can compete. So fr, shut up with that Bailey & Kenneth stuff. They are great friends and it’s always nice to see em together, but they have never matched styles much and there’s nothing special about the two of them together except that Kenneth can sell being in love with any girl he dances with. This is a great seg-way to my next point.",
        "3. People saying Kida and Bailey don’t match in style at all are bonkers, I swear.",
        "I have been a supporter of Kida for nearly a decade now. But I first started really getting into Bailey last just year (2019), after watching a few of her performances on The Championship Series WOD. I was incredibly impressed with her musicality and creativity during the performances bc I had never known her for being that technical. I had always just seen her as a typical urban dancer like she was before she began training with the Kinjaz and Tim Tim. The way she interpreted the music thru dance reminded me much of Kida so much that I even posted a comment at the time saying, *put in screenshot if I can* “Really want to see a WOD Collab of her and Kida with some of both their choreography. Their styles compliment each other so well and seeing Kida do something new with his main styles like Bailey’s choreography would be dope to see. They would have so much fun.” Atm, I never thought this dream of mine would come true [you can even see it in my Dance Dreams post thing that I will upload someday hopefully relatively soon….]. My point is, from day 1 of seeing Bailey’s excellence, I knew her and Kida would a great match for each other. I would have paid to see them collab bc, to me, they mimicked each other’s swag, passion for popping, intricacy, ear and interpretation of the music (musicality). Bailey danced like a female Kida to me. Then once they finally did collab for a class, others started to agree, saying they were the male and female version of each other. I was siked. Even tho many were showing polarized support for each of them, people weren’t really talking about them not being a good fit for each other until after their WOD Qualifier was released. It felt like all of sudden, no one thought they were good matches anymore; viewers didn’t have their expectations met after seeing their first dance together, so they decided that, now, the two of them were no longer a good fit. Maybe it was just a different population of their fanbases’, but it felt like dislike of the two together was much more appearing with the WOD Qualifier, as if “fans” had turned on them bc this was now a competition so they wanted only one of the two to be praised. This could be an impractical hypothesis, but it is just how things feel. To anyone who doesn’t believe Bailey & Kida’s styles are similar, I would just ask you to watch their individual WOD performances and tell me if they really are all that different. I also would ask specifically how did they not match during their World of Dance Qualifier? I thought the energy and sync in between each other was great. The only part that lacked was the chemistry. I think the only distracting pointer for me regarding fitting with each other was their outfits. A better effort could have been made to match the outfits better bc that would make them look more as one unit rather than two people who happened to be matching one day.",
        "Now, with these three points said, I can agree with some who say they seem to find Bailey more hard-hitting while Kida is smoother. I do not think I noticed this beforehand when watching individually. But I think that is nothing that would be difficult for them to match with each other. I know that Bailey can be smooth if she wants, as Kida can be more hard-hitting. They can just mix up the dynamic of their moves to include some of both and make sure they put in the same energy in every move.",
        "I have also noticed a lot that the two of them have very distinct fashion which can be a bit of a distraction. Like I pointed out in the above paragraph, they could work on matching up more for their performances together. Especially bc Bailey likes to wear very loose clothing that’s a bit overgrown for her and Kida loves hoodies. The issue with the overgrown style and hoodies for their style is that it hides the small details they put in their dances, and their style heavily relies on the details. The overgrown outfit makes the dance look wilder which doesn’t work as much for the clean and precision-based parts of the dance and the hoodie can hide Kida’s isolations.",
        "Lastly, I can’t say that I don’t think there’s the possibility it would have been a better match for Kida if he had gone on the show with Kendrick & Jabari. Those three are very used to dancing with each other and so their chemistry is top-notch and they are all very versatile in hip-hop, not limited to urban choreography. I also know that Kendrick and Jabari are very creative individuals, so their contribution to the choreography could help them get far as a unit. But I like seeing Bailey on that stage and I think Kida is the best partner for her to be doing this collab with. Bailey and Melvin match each other a lot in dance and fashion style a lot, but her and Kida are closer in age, have bigger strengths together and I think their personalities off the dancefloor gel together better. It is also fair to say that I think people are holding Kida & Bailey to pretty strict expectations with this “style” yak. Kida has danced with TAT and none of them specialized in the same style or had much chemistry together, but everyone loved them. It was even clear that Juju and Gavin spent more time with each other outside of the crew. Kida, Jabari and Kendrick don’t naturally dance very similar. It feels like people expect Kida & Bailey to be 100% mimes of each other, but if they danced with people that they are both already very familiar with, it wouldn’t matter. Admittedly, the chemistry may be stronger just bc they would know their dance partners better, but they would lose the dance-twin effect that I do believe Kida & Bailey have better than anyone else they could each partner with. Additionally, I want to say more directly to an article I read about their Qualifier performance, this duo is not supposed to be just the two pairing up to get clout bc they recognized each other’s skills and thought, “we can win together bc we are both dance Gods, so let’s grab the money real quick and be outro.” This duo is meant to last. Bailey and Kida wanted to pair up bc they want to take their dancing to the next level, and do it together. It does not end for them when the competition is over, as they have said many times now, “the crazy thing is this is just the beginning for us together.” They both have been being bugged every yr by WOD NBC to compete on the show, so they decided to finally cave in and do it together. This partnering is not about a selfish and money endearing win, they are dancing together bc they are friends who want to be a unit bc they respect each other and each other’s talent and want to put it all together to be something elite.",
        "I’m gonna be honest, I do think that gender and race play a bit of factor in the division of their “fans’” support.",
        " For gender, Bailey is a hard-hitting female hip-hop dancer. We don’t see that a lot, and I’m convinced that most of the people who watch the LA Studio videos (or at least most of the people who comment under them), are teen females bc they are always on that shipping sh*t [guys don’t typically publicly ship others from what I have noticed]. They hype up the females a lot because of this. They want to empower their folks. I’m all for giving the female dancers credit when it’s due, especially when it’s smth that female dancers generally don’t get a lot of attention for. But when it’s to the point of giving no one else their deserved credit, it bugs me. I used to see this with Kida & Lil Phoenix too when they would dance together. Viewers would hype up Lil Phoenix a lot more and act like she was the best, even though Kida was always clearly far better [she was young, and her body and technique was not as developed yet]. I mean, when she was on Good Morning Sacramento with Kida and some older dancers, I understood the GMS hosts complimenting her the most bc she was the youngest, and I get it when battle hosts do it too, but in YT comments, it’s confusing. It is just gender bias there. I’m not asking YT commenters to only compliment who is best, just why act like one is more attention-worthy than another? Another example is that Kaycee gets a lot more hype than Sean does, and I do think for most fans, it is a gender thing. Moreover, I’ve also noticed that when I post YT videos on my Javacow YT channel [I post dance compilations there, check it out if you want], the female compilation videos always tend to get A LOT more views, likes and comments than the boys videos do. Once on AGT, I remember a dance duo performing, I think it might have been D’Angelo & Amanda, and after the dance it was either Mel B. or Heidi saying how normally when watching duos, it’s always the female dancer people wanna pay attention to and the guy is just there, but with this duo, they enjoyed the guy (D’Angelo, by chance) just as much. So overall, there is a bit of gender bias in this industry I believe. I don’t share it, in fact, sometimes, I might even say I have the opposite bias bc I think guy dancers dance really clean and most female dancers I have seen, don’t…but I love women, man, and I appreciate dancers like Bailey, Phoenix and Dytto, who can represent the popping industry as females and level with the guys, and don’t have to shake their asses a lot in the studio to seem relevant and capture attention. Even dancers I love like Kaelynn Harris, Deja Carter and Cache Melvin seem to love shaking their booties all the time, which is a no-no for me in terms of attractiveness [but that’s my opinion].",
        "Then race, is the second part of it, I think. I think most of the dance video watchers are young White and Asian females. Because of this, they find the Asian and White dancers at the studios more attractive and just have a subconscious bias to them. Like notice how Gabe, Sean and Kenneth ALWAYS got more support from fans than Will and Josh during the Boy Squad days. Fans would literally comment sh*t like “Gabe, Sean and Kenneth ♥♥” and exclude the two beautiful Black boys. Back in the prime days of The Art of Teknique, I would see a lot of comments like “Gavin and Kris are sooo cute,” and Kida would just be forgotten. I would see that a lot. That’s how I came to figure looong ago, that most of the fans of those online dance videos were Asian folks. The instance is the same with Charlize being underrated and, even though Jordan Natae was just as good as Tate was on SYTYCD Jrs, Tate got waaay more of the fan talk [although, to be fair on that one, Tate had more fans than Jordan to begin with]. Kaycee, Jade, Josh Beauchamp, Taylor Hatala, Maddie Ziegler, Haley Fitzgerald….are all some White dancers who get a lot of clout from fans too, so I assume there are also many White fans watching the YT dance scene too, although that may not be as accurate because I do think many Asian females are attracted to White guys (and vice versa), and that means they are probably chill with White women as well. Call me crazy for all of this and drag me for bringing in race, but I feel like the people who are doubting me about all this are just scared to admit that this is real sh*t. The evidence speaks for itself; the Black dancers aren’t getting as much credit for their dance talent on YT as the White and Asian dancers get. They get overlooked. The Black community is mainly on Instagram [and Twitter] as it seems.",
        "Ok, I got out a lot of smoke that I’ve been feeling lately with this rant. To conclude, shut up about y’all negative comments about BK, and just enjoy the two dancing TOGETHER or be gone man.",
        "[*hip-hop: Pls know that the definition of hip-hop is on these commercialized shows is inaccurate to what the style really is. I’m calling it hip-hop here bc that’s what the show calls and I don’t wanna create confusion in what I’m talking about, but note that neither Kida or Bailey are dancing hip-hop in this competition. The correct title would be popping.]"
      ]
    },
    {
      "id": "bailey-and-kida-1",
      "title": "Bailey x Kida: Why are “fans” trying to pit them against each other???",
      "date": "2020-04-15",
      "img": "https://artist-collector.com/img/m/3642.jpg",
      "img_position": "0 12%",
      "img_credit": "Instagram video",
      "content": [
        {
          "text": "I felt like I had to speak on this bc after being so excited and ecstatic about finally a Bailey x Kida collab (something I have been wishing for nearly a year now), it was off-putting to read the comments under their first two collab YouTube videos (Snowglobe Perspective & Kinjaz Dojo classes) and see so much one-sidedness from fans. I was expecting lots of reactions like mine, like “OMG this is the dynamic duo I needed” or “these two are killer together,” but instead found a lot of comments singling, mostly Bailey out, e.g.:",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "“Bailey has impressive choreo moves 🔥😀💯🌟”",
          "indent": false,
          "type": "li"
        },
        {
          "text": "“bailey just being the 🐐”",
          "indent": false,
          "type": "li"
        },
        {
          "text": "“Bailey sok is a mfkin queen of dancing”",
          "indent": false,
          "type": "li"
        },
        {
          "text": "“👊🏻👊🏻Bailey \"THE BEST\" Sok 👊🏻👊🏻”",
          "indent": false,
          "type": "li"
        },
        {
          "text": "“Bailey snapped and they both did very well 🔥🔥🔥 💯”",
          "indent": false,
          "type": "li"
        },
        {
          "text": "“BAILEY SOK GOING PLACES MAN 😍”",
          "indent": false,
          "type": "li"
        },
        {
          "text": "“Kinjazz & Bailey ❤️❤️❤️😍”",
          "indent": false,
          "type": "li"
        },
        {
          "text": "“Bailey is killin it”",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Like I understand that ofc people have prior favorites that they have been supporting for longer or more intensely over time bc they discovered them first, loved the person, and/or just found them as a better dancer than most others…so I think it’s completely sensible for someone to comment like “Go Bailey” or “I love how Kida pops”… but these comments like are specifically one-upping her and it wouldn’t really matter to me except that these two were dancing completely in-sync right next to each other. To compliment only one of their choreo or their execution or say one of them did the best, just feels like one is purposely trying to leave the other out. Like if they were not completely in-sync or danced separately and didn’t work together to jointly come up with this choreo, it would make sense, but when someone emphasizes how one of them is “the best” or only compliments one of them for how good the choreo is or only mentions how one of them is doing a great job, it kinda feels like it’s like spitting the other in the face. When I first viewed the comments under Snowglobe’s channel, I kind of felt obligated as a longtime + hardcore Kida supporter to post a compliment specifically to Kida bc there were sooo many that were specifically for Bailey that I just felt bad for him. Like Kida was getting no love when he was doing equally as good and contributed just as much to make the choreo as lit as it was [and s/o, he was the one who taught the choreo too I believe, bc from all the video clips of the class that I saw, he was the one doing the counting and teaching while Bailey danced beside him like an assistant. Like it’s quite fairly possible she taught some too, but it did look like Kida was doing most of the ‘heavy lifting.’ So, it is really twisted for Kida to not be getting much respect from viewers]. I’ve even been liking comments that are specifically just complimenting Kida now just to try and even things out more bc like at least 95% of the singled compliments from both videos combined are for Bailey and they have hundreds to thousands of likes, while ones solely complimenting Kida may have like 1 or 2 if any at all. I don’t like seeing how lopsided the supporters are being. Like even if they knew one of them much better than the other, how can one not say they both equally killed it?? Like maybe one liked how Bailey hit the woah over Kida’s woah, but it’s not as if Kida’s woah was messy, and it’s not like that minor move should make a real difference between who killed it and who didn’t, it was just a different energy. Both of them could hit the woah exactly how the other did if they wanted to, so it’s not a difference in skill. The few times the two were not ‘clones’ in What’s Poppin’, was when one did some small-a** change that typically complemented both the choreography and the other dancer. For example, I like how they both did the part at 0:29 in the Snowglobe video a tad bit differently bc together it looked sick. It was as if Kida was pulling Bailey to the right with an invisible string or sum. It was Kida I believe who had changed that move up a bit to make that subtle difference, but it made both of them look better. There is a comment I spotted that went as far as saying, “Bailey completely outdanced kida lol.” Like first off, literally how?? And second, what is the significance or necessity in saying that? It’s like you’re intentionally trying to trash Kida.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "There was this one rude comment under the Snowglobe video of this guy telling Kida he better wash his hands bc of the coronavirus (bc he had been dancing with Bailey who is of Asian descent), and ofc it was just wrong of this person to comment, but then someone’s response just escalated the situation to become exactly what I’m talking about. They said, “Yeah I can see how kida's fans are rude and disrespectful people. How can you say that about bailey you dumb ass b**ch.” The second sentence was quite understandable, although admittedly juvenile as the person could have handled the response more maturely [whatever tho], but the first sentence was throwing rocks at Kida’s fans. What’s even more stupid is that the comment got 7 likes [7 doesn’t sound like a lot, ik, but for a situation like this where the comment should have gotten 0 likes, it’s disturbing]. Like one rude a** person said this very racist and demeaning comment intended to pick at Bailey and that was very wrongful and an example of what I am talking about with this picking one over the other drama, but to then say/conclude that all of Kida’s fans are “rude and disrespectful” makes no fricken sense and it was, imo, almost as offensively targeting as the OG comment [not as rude, but meant to be just as hurtful], tho targeted to the fans of the dancer rather than the dancer. The fact that they even went there to throw shade at Kida’s fans after reading that ONE comment, tells me that this person and the likers were just ready to find something negative to spit about Kida’s fans. Like if they gave any f*cks about the partnership rather than just Bailey, they wouldn’t have targeted Kida’s fans like that bc they would be supportive of Kida themselves. These “fans” were ready to jump on Kida and his people as if just to try and say “Bailey is so much better.” I just don’t understand why.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Real question to all the “singling out” supporters who actually feel the need to diss Kida and/or his fans, do you think doing this will make Bailey respect you more? Do you think she’s gonna see your comment and be like “OMG I love you for thinking I’m better than Kida and that people should like me a lot better, thank you soo much!” Bc, personally, I think it is more likely that she will see the comment and disapprove of the fact that you’re putting down her good friend + teammate, and/or the people who support him. They are a duo, they are in this together…they chose to be on World of Dance together bc they wanted to work TOGETHER, not bc they wanted their individual fans to tell them how good they are individually. If they were looking for your individual support here, they would not be in this together working as a duo. I think it would be a lot more meaningful and pleasing to them to see people talking about how much they love the two as a duo instead of highlighting one over the other, bc that will give them confidence in their partnership and decision to work together. Maybe YOU don’t want them to work together and you think your favorite is better off solo, but clearly, that’s not what they thought or wanted, so if you are a supporter of them, you would respect their friends, especially the ones they trusted to do something as big as competing on World of Dance together with [which one may not have known at the time while commenting, but, even so, I believe them just doing a collab together is saying enough]. They are the expert dancers after all here while YOU are likely not, so maybe you should trust that they know what they are doing. And even if you see them together and somehow believe that Kida will bring Bailey down in a partnership or vice versa [which tbh, I can’t possibly believe anyone who is not purely biased could actually watch them together and believe that], you should realize that it still won’t make anything better by dissing the other dancer. In your favorite’s eyes, that is highly likely not truly appraising them or caring about them, but instead being childishly rude and that’s a put-off. If either Kida or Bailey read those kinds of comments and don’t feel they are rude in any way, then I would say they are definitely not humble and don’t deserve as much respect as they get, but being pretty familiar with both dancers, I know that’s not true and that they love to praise each other more than themselves. Both of them are some of the humblest dancers you will find in the dance world from my observation. They don’t talk bad about any other dancer in any way, they show a lot of support to other dancers, their friends and their fans, they don’t seemingly change their persona when on camera or try to ‘showoff’ in any way [and that can be trying to act ‘cute’ while dancing or trying to do whatever they think will get the most audience reaction rather than just acting like a “regular” dancer – not an extremely popular or viewed dancer]. I can name several dancers I have seen over the years who fit into at least one of those categories. Bailey and Kida are far from any of that. In fact, Kida has a hard time getting aggressive even in dance battles. He reminds me of my younger brother who literally could not lie during the card game, ‘BS’, which is all about lying and fooling the other players [look it up if you’re not familiar], and therefore, kept losing just bc of his humble self and innocent morals. Kida will point out when their opponent does a dope move during the battle and he will pay attention to the opponent’s round instead of talking to others or trying to do everything to not pay attention [I’ve seen him pace instead of watching an opponent’s round before, but it was evidently out of stress and trying to feel the music rather than attempting to be rude, and it’s rare he will do even that].",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Originally, I was very hyped to see, not just the two competing on World of Dance together, but also the audience reaction. I was excited to see what people thought of this insanely dope duo and see them getting loads of support, but now I’m less pumped. I feel, again, like 85-90% of the comments under their videos will be solely about Bailey as if her fans are blind to Kida being there at all. In a situation like that where they are competing together rather than just performing their class choreo together, I feel it will be extra off-putting to see fans only paying attention and giving love to one of them and even more sickening to see people shading one to bring the other up. Like they will be COMPETING TOGETHER and people really just wanna completely ignore the partnership…the duo…the TEAM. It is working together that gets them far in the competition, uplifts each of them and motivates them to do their best and step up their game. But the “supporters” …they just wanna look right over that. The only thing that matters to them is that their individual favorite dancer is up there getting clout. Doesn’t matter who helped them, how they got there or who they worked with. These ‘fans’ don’t care who their favorite dancer appreciates the most for being on the big journey with them, making it possible for them to get as far as they got + giving them a lifelong friend they can rely on who loves and truly supports them. The only part the fans see is the individual, they just wanna look over and exclude everything else. Nothing else matters to them but their favorite succeeding above everyone else, even above the people they love, who helped them achieve so much……I just can’t….. I can’t seriously be the only one who finds the singling out/exclusion to be super disrespectful.",
          "indent": true,
          "type": "paragraph"
        }
      ]
    },
    {
      "id": "gabe-de-guzman",
      "title": "Gabe De Guzman: Seriously, why do people hate on him??",
      "date": "2019-09-16",
      "img": "https://images.unsplash.com/photo-1523354177913-be035fcee55e?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1674&q=80",
      "img_position": "0 60%",
      "img_credit": "Georgia de Lotz on Unsplash",
      "indent": true,
      "content": [
        "Well, I think there are two main (and stupid) reasons people hate on Gabe.",
        "1. Because he moves so uniquely, but I feel like a lot of people blame that on him. Gabe has a unique natural flow when he dances so it makes him stand out but I notice that several times when people accuse Gabe of being too wild, if you look at his arm and leg movements compared to the other peoples’ around him, he doesn’t actually move them any more than they do. He’s not “overdoing” it a lot of time, it just naturally looks different when he does it because of the way his body is shaped and moves (keyword is “naturally” – something you’re born with and can’t change). I feel many viewers fail to understand that not everyone can just look the same when they dance if they try to. That’s not how bodies work. Gabe’s smooth is never gonna look like Bailey or Sean’s smooth. His flow is never gonna look like Bailey or Sean’s flow and I think the result of his uniqueness is that viewers call him messy because it’s not what they are used to; it’s not what most others look like. But that’s not fair to blame on Gabe because he can’t change it. He can only be himself. One can’t change things that are natural about them and why try? Why should anyone have to? Personally, I love that he’s unique. I always look forward to his interpretation of a dance because I know it’s gonna be special/much different from everyone else’s. Ofc that doesn’t excuse things he could work on at times like there are sometimes when he lacks cleanliness or appropriate facials, but everyone messes up and has their own weaker areas they can improve in.",
        "Remember that in most of these videos, this is just class. It’s a space for people to mess up, try new things, focus on different areas, practice their skills, etc. Those choreography videos are NOT performances. They record them so that the dancers can look back at themselves and see what they liked and what they want to improve on. It’s rewarding for them. The choreographers/studios are also kindly just sharing different people’s interpretations of their choreography. It’s rewarding for both the dancer and choreographer to see and be about to reflect back on themselves/their work and share it with aspiring dancers and supporters. Us viewers have no place to judge them as if they were all supposed to give the performances of their lives during dance class. If they don’t do their best, so what? I see many people under choreography videos trying to say what Gabe did wrong as if they are judge panelists and Gabe has to impress them while he’s taking classes or else, he’s canceled.",
        "The 2nd reason I believe is because of Gabe’s history w/ Kaycee. I think people started disliking Gabe because Kaycee seemed to drift from him and they sided with her and I think it makes a lot of Sean & Kaycee fans in particular dislike Gabe and they think Kaycee & Sean together are “cute” and so they try to drag Gabe’s dancing and personality as sort of an impulsive way to prove their loyalty to Sean and Kaycee, which is also not fair because we don’t know what may have happened between anyone and they are all teenagers with their own petty drama that we are not involved in. We have as “fans” have no place to decide who’s faulty of what and most of us have had teenage drama of our own so we can’t expect either one of them to be perfect. If a dance Gabe did was exactly the same except it was Sean doing it, for ex., I’m for sure Sean would get a lot more compliments and “wows,” and it’s fair to notice that back when Gabe and Kaycee were dancing together, Gabe did not get so much hate. People would comment on how cute him and Kaycee were together. I also think because of the “Gaycee” split, those particular viewers stopped watching Gabe alone and mostly only see him dance when he’s in videos ft. Sean or Kaycee (or Bailey). Because of this, they lack knowledge about him and say things like “he never pushes himself” or “he always dances the same”. But if one were to consistently watch a wide variety of him, those statements are widely not true. This is just what I’ve noticed, and I know that people who may relate especially to the latter statement often deny it, but one can kinda just tell by their comments. I think mainly, people need to realize that although you may not dig the way someone dances, it doesn’t make them bad at it. They just may do things differently than what you’re used to enjoying.",
        "I think Gabe is a nice person. I don’t think he is cocky or aggressive at all, and if you follow him on IG or pay much attention to him outside of while he’s dancing, you will notice he’s very humble, kind, shows a lot of gratitude, supports other dancers while they are dancing and when people compliment him under his videos, he will generally respond to like the first 20-30 comments to kindly thank them, which is something you don’t typically see people with large followings like him do. When his pals post about him, they always seem to have very nice things to say and it’s obvious to anyone who follows him that he has A LOT of friends. He seems like a great friend. After watching several compilations of Gabe, I have noticed that he tends to end up in the final spotlight most of time even if he doesn’t start out in the middle. I believe when on the dance floor, he gets very excited, thus why this happens. He is very expressive and passionate and loves to go all out; he puts everything he can into his dances and never holds back and this makes him one of the few dancers I’ve watched who just always seems comfortable. I don’t believe he comes onto the dance floor with the mindset “okay, I have to out-dance everyone else here,” I think he just gets deep in his own bubble, sometimes so hard that’s he not being very aware of his surroundings. He is a great soloist because he knows how to utilize the whole dance floor. Most people stand mainly in one spot or might go right to left once or twice, but Gabe goes everywhere; he puts on a show when he dances. Because of this, I believe that when he’s constantly paired with someone else or put into a group, it can make him look like he’s just trying to gain attention the whole time. His constant moving around, added nuances, and expressive movements combined with his amazing dance talent typically steal the show and then people start complaining that he’s trying to compete or whatever. During freestyle sessions after choreography, he will end up in the front a lot of the time because there’s more space for him to move freely and moreover, when in a duo, the crowd starts only paying attention to him because he’s so expressive, mobile, creative and musicality talented, which makes the other dancer(s) typically stop/back up and sometimes leave. I’ve never seen any of those dancers ever back away in annoyance though. They all seem pretty happy to watch Gabe go awf. I have noticed (only a couple times) that Gabe has interrupted others’ solos to begin his own. Again, I don’t think he’s trying to steal the spotlight or be rude, I think he just gets excited and doesn’t really think about what’s he doing in the moment. It’s something for him to work on ofc, but I don’t dislike him for it. We all make mistakes and it’s rare that he does that anyway. I have noticed nowadays that after choreography, Gabe has been better at pulling people in when he’s done freestyling if they are still waiting around for a turn.",
        "Ultimately, as I said though, I believe choreographers are better off not pairing him with anyone. Gabe is a terrific soloist and can make more hype with just himself then I’ve seen a whole dance crew make sometimes. He makes me shout and want to get up and jump a lot of the time. He’s completely original in every choreography and freestyle he has done and no one else dances like him. And just his freestyle dancing abilities are phenomenal. When Gabe is dancing with other people, I can always ever only watch him. His expressiveness, originality, musicality, character, hype always tends to outshine whoever’s near him and your eyes can’t help but watch him. He could work on stepping back for other dancers more often, but he shouldn’t have to. He should just be allowed to go solo and completely and freely show himself. Again, this is just class, it’s not like he’s taking away someone else’s performance time. It’s a time to practice and try new things."
      ]
    },
    {
      "id": "world-of-dance",
      "title": "Is World of Dance NBC rigged for popular dancers??",
      "date": "2017-07-02",
      "img": "https://upload.wikimedia.org/wikipedia/commons/c/c9/World_of_Dance_Polska_title_card.jpg?20190127235638",
      "img_position": "0 38%",
      "img_credit": "Wikipedia Commons",
      "indent": true,
      "content": [
        {
          "text": "In short, my opinion is no. I feel that everyone who believes this is just upset that their favorite dancer didn’t win when they were compared to a dancer or dancers who happen to have a bigger name in the dance world, but what people don’t understand is that these popular dancers don’t get famous for no reason. They are famous for being good dancers. That’s typically how dance seems to work from what I’ve noticed. Singers can get famous if they have completely no talent, as long as they have a catchy beat or and auto tune and “good looks,” but with dancers, they mainly need to have talent to be recognized. The only situations I can think of where dancers who may not be good become popular is:",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "1. They also sing or rap",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "2. They make up a really popular dance trend and do that a lot on Instagram",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "If either of those apply, they become famous for that, but commonly aren’t seen in actual dance competitions or battles.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "People complain that Fik-Shun only won Nick because Fik-Shun has a name in the dance world, or that Les Twins will win only because they are already popular and the show wants their ratings up. I mean what are the judges supposed to do? Automatically eliminate everyone who already has made a name for themselves just to prove that they aren’t rigging the competition? Well guess what. Les Twins and Fik-Shun are actually good dancers so sometimes, believe it or not, they might win *Gasp*. If the judges are so concerned about ratings or the competition was rigged, then:",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "1. They would have given Jabbawockeez a higher qualifier score. There are many less popular contestants who got higher scores than they did.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "2. ImmaBEAST crew would be shown on TV and YouTube. They are a popular kids group that are all part of the Beast Network, made by Willdabeast, a very popular choreographer and consist of many well-known kid dancers who typically get many views on the videos they are featured in (commonly 500k – 1 million views). A lot of the kids in ImmaBEAST have danced at World of Dance events before.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "3. Kings Unite would be shown on TV and YouTube because it consists of some amazing choreographers who get from 500k – one million views on their videos on YouTube, for example: Jake Kodish and Alexander Chung.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "4. Fik-Shun wouldn’t have been eliminated from the World of Dance snapchat battle, because we all know he should have won his battle against the high fiving ballerina. (I never watch Larry’s battle and I know Laurent got eliminated because he injured himself.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "Also, let’s remember that the judges don’t know the final score until all their scores are automatically adding up. There could be a judge who gave Nick a higher score then Fik-Shun, but the other two gave Fik-Shun higher, giving him the highest average.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "If you’re upset that Nick didn’t win or that Kyle got eliminated, just realize that both dancers were up against some real competition. Fik-Shun is amazing at hip-hop and just performing in general. He had amazing body control, he switched the mood up from his first performance showing versatility, and had excellent musicality and performs in a way that keeps you interested unlike many other solo hip-hop dancers who have great skill, but not much performing skills. If you’re not very familiar with street hip-hop dance, you may have overlooked his skill, but it’s definitely there. Les Twins are very versatile and some of the most creative dancers I’ve ever watched. Their musicality is stunning because move to small nuances in the songs I would never have noticed if they weren’t dancing to them and they hit the beats in the most unexpected ways. They have made their own unique and original style in hip-hop dance that people have started labeling their moves “Les Twins moves,” and calling others out when they use them. Their performances showed their amazing musicality and creativity and they were doing extremely fast moves while making them look very clean and both staying on beat. What they do is nowhere near easy. In both duels, I think all contestants did really well, but Fik-Shun and Les Twins both took each of their battles, even if just barely. If I can think that, the judges have the right to think that too.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "You guys have the judges in a bind here, because they don’t need to score Kyle higher than Les Twins even if they believe Les Twins actually did better, just to prove to some picky audience that they aren’t being biased. If they did that and picked the winner opposed to what they really thought, they would be being dishonest, but if they chose Les Twins over Kyle like they did, then the audience is going to complain that the judges are rigging the show like are. What do you want to judges to do? Be dishonest or be “dishonest”?",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "If we see a performance where CLEARLY someone opposed to Fik-Shun, Les Twins or Jabbawockeez (the most talked about crews right now) did better, but those three won, they we can have this talk again, but otherwise, I believe this: The judges are just being honest with their opinions. They’re not rigging the show in any way by thinking these two amazing dancers are actually amazing and won their duels. I wouldn’t be surprised if someone already popular wins the whole thing, because they are really GOOD.",
          "indent": true,
          "type": "paragraph"
        }
      ]
    }
  ],
  "film_blog": [
    {
      "id": "sterek",
      "title": "'Sterek?' Really?",
      "date": "2021-01-06",
      "img": "https://cdn.pixabay.com/photo/2022/10/07/04/41/werewolves-7504082_1280.jpg",
      "img_position": "0 40%",
      "img_credit": "Art by Seth Metoyer'",
      "indent": true,
      "content": [
        "I don’t get the Teen Wolf characters Stiles & Derek ‘Sterek’ ship. I never have. The truth is that fans just like Stiles and they like Derek and like their dialogue together and therefore wish there was smth going on between them. But there isn’t. If anything, it would make a lot more sense that Derek likes Scott.",
        "Now first, I don’t think the writers of Teen Wolf would make such prominent characters like Stiles or Derek gay without flaunting it in the show. There’s too much of a lack of representation of gay characters on TV to just be selfish like that by hiding such substantial information. By introducing several gay characters, Teen Wolf showed LBGTQ relationships are smth they fully support and are not shy to put in the script. The representation clearly matters to them which is why I doubt they would pass up on the opportunity to spotlight Stile’s gay feelings for Derek, had they been a thing. Stiles never showed any romantic interest in Derek in fact, the relationship was clearly always a bit rocky. They are friends, but consider each other pretty annoying. Derek thinks Stiles is a \"hyperactive spaz” while Stiles described Derek as having “no sense of humor.”",
        "Let’s look at Derek and Scott though. I couldn’t help but notice that Derek has a bit of an obsession with Scott. I don’t think it’s reciprocated though. Scott isn’t crazy about Derek, but Derek takes Scott in as his mentee in season 1 and helps him even after he repeatedly hoed Derek. Scott got Derek arrested and then later falsely framed Derek for attacking him and his friends in the school after killing the janitor. Derek never gives up on Scott tho. Scott is like the only one he ever puts his full trust in. He is also clearly inspired by Scott a lot of the time and, in a way, looks up to him. He tells Scott that Scott probably taught him more about control on the full moons than vice versa. Notice that Derek will always drop anything to go save Scott. He will kill or be killed for Scott [Derek kills Allison’s mom in season 2 and tells Braedan in season 4 that he’s okay with dying in Mexico if it saves Scott and Kira]. In season 6 when Derek returns for the Wolves/supernatural vs everyone else war, Derek says the only reason he went back to Beacon Hills was for Scott.",
        "So with all that, idk how people can really think “Sterek” was meant to be. It goes to show it’s all just fans' wishful thinking. Derek clearly had feelings for Scott if any guy, although like I touched on before, I doubt Derek did have feelings for any guy."
      ]
    },
    {
      "id": "endgame-hopes-and-predictions",
      "title": "Avengers: Endgame - Hopes & Predictions",
      "date": "2019-04-19",
      "img": "https://live.staticflickr.com/65535/48012535296_a3878d12e0_b.jpg",
      "img_position": "0 5%",
      "img_credit": "Flickr",
      "indent": true,
      "content": [
        "The movie I’ve been waiting a year for is finally coming out tomorrow! After seeing Infinity War and getting completely tied into the MCU, I couldn’t wait to see what happens next. I now get to find out in two days.",
        "Frustratingly, someone on Ask FM decided to be a dick and spoil that Iron Man dies in Endgame (the movie came out in different parts of the world on different days and time-zone changes, etc). So, apparently that happens, which was my guess, but it’s still annoying someone would do that. I thought about replying to shame them, but I concluded on just blocking them instead. I’m skipping over anything I see that’s Avengers related for the time being.",
        "Other than Iron Man though, I’m predicting that the heroes that “died” come back. So that includes Spider-Man, Black Panther, Star-Lord, Dr. Strange, Bucky, basically everyone who was not an original Avenger. I don’t know how, but a lot of theories are that they reverse time with the time stone, and I think that might be the most plausible guess.  If they reverse time, then no one will notice that half the world died, and things wouldn’t seem weird afterward in Spider-Man FFH. It will be like nothing happened, which is what the trailer kind of entails it’s like. Although, then again, they didn’t want to spoil anything from Endgame in the FFH trailer. The other most popular theory I’ve heard is that everyone who died was actually just stuck in the time stone. Apparently, this is what happened in the comics. Or one of the versions of the comics (the comic story-line confuses me). People I don’t know about surviving are Gamora and Loki. I definitely do think Loki is dead and will remain that way but idk about Gamora because I know there’s a new Guardians of The Galaxy movie coming out. It would be weird to have one of those movies without her I feel so idk if they are really gonna do that. One thing that confused me is apparently, Shuri is dead. Or “dead,” but the actress, Letitia Wright, said that Shuri was still alive in an interview I read a while ago. According to the trailer though, Shuri is dead. But as I said, I think they will all come back."
      ]
    }
  ],
  "movie_reviews": [
    {
      "id": "far-from-home",
      "title": "Far From Home",
      "date": "2019-07-10",
      "img": "https://www.trustedreviews.com/wp-content/uploads/sites/54/2021/12/Spiderman-PS5-suits.jpg",
      "img_position": "0 64%",
      "img_credit": "Gemma Ryles on Trusted Reviews",
      "rating": "/assets/ratings/4.5-stars.png",
      "content": [
        {
          "text": "Unfortunately, I got cut off by the blue screen of death on my computer during my hopes and predictions writing, so I never really finished everything I had to say before the movie. But now I’ve watched the movie twice now, and here’s what I thought.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "I think the movie was definitely better than the first one. Maybe I’m biased because Zendaya was barely in the first one but she’s in this one a lot, but there were more action scenes, more humor and I think the villain was more interesting. I liked the idea of illusion tech with drones for real destruction. The movie did take longer to get to the climax, but once it did, it got really fun (not that it wasn’t fun before). No character died, which is something a lot of people were predicting, so that was nice. Well, actually Mysterio died I guess, but some people are predicting that he’s not really dead. They say it’s just another illusion of his. Idk, so we’ll see, I guess. I was right about Mysterio being the bad guy though. I didn’t trust him the whole movie and about halfway through, I was right, he is not the guy to trust. He was the main villain. Hydro-Man and all the other ones were just illusions made by Mysterio that looked really real. There was also no such thing as the elementals, and I guess the multiverse was also a lie. Idk if I had time to mention the elementals and multiverse from the trailer in my pre-writing, but yeah…it was all a lie. I’m just realizing, in my dream last night, I had a book about grammar that I was reading. Hmm interesting. Anyway, Ned and Betty did get together, but then they broke up at the end of the movie (LOL), but Peter and MJ starting dating at the end. MJ also admitted that she knew about Peter being Spider-Man for a while, and she mentioned the Washington Monument, so I guess she put two and two together back in the first movie. Although, she said she was only 67% sure until he admitted it.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "What me and a lot of other people liked about Peter and MJ’s relationship is that MJ didn’t have to change in order for Peter to like her. It wasn’t like in the first movie she was this sarcastic, nerdy and awkward character and then she evolves into a “pretty”, social and romantic character or something so then Peter starts crushing on her. She was still sarcastic, nerdy and awkward in FFH and Peter liked her for that. Peter is nerdy and awkward himself so he had that relationship to MJ so he started liking her. It’s a lot more realistic and had a much better message. I also liked how Peter stayed realistic to a high school student the whole time. He was constantly doubting himself, downplaying himself, just wanting to tell a girl he likes that he likes her, buying the girl he likes a gift, using Edith to resolve high school drama, prioritizing liking a girl more than super-hero stuff….you know, it’s just the movie keeps Peter very realistic to a high school kid the whole time and I love that.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "I got the “unexpected ending” part though. It was that Peter’s identity was revealed to the world by Mysterio and his crew. Yeah, it was pretty unexpected. I wonder if the next Marvel movies to come out will address that or if it’s not until Spider-Man 3 when we find out how this worldwide revelation affects Peter. But I might not be alive to see Spider-Man 3. It’s okay, I’m good enough with Spider-Man FFH. And I’m just glad the ending didn’t have to do with someone dying or MJ being a bad guy or Nick Fury being MJ’s father or something like that. Those were some predictions. Watching the movie made me realize how good Marvel is at keeping their movies underwraps. There are all these predictions all the time and you start thinking, “mann, these guys gotta be right,” or “that actually sounds like it could be legit,” but then like all predictions are way off. No one saw the elementals and multiverse being fake coming and no one saw Peter being revealed coming. I sensed that Mysterio was the bad guy and I believe many others did too, but I think also, a lot of people were fooled by the trailer and interviews. Like Marvel is just good at what they do. Every movie series should aspire to be like them.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Here’s some predictions for FFH that were wrong though.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "They were not mainly in London and the trip was not about anything for Stark Industries",
          "indent": false,
          "type": "li"
        },
        {
          "text": "There was no MI6 agent",
          "indent": false,
          "type": "li"
        },
        {
          "text": "There was no one names Alistair – I think they meant Brad",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Liz was not in the movie",
          "indent": false,
          "type": "li"
        },
        {
          "text": "J.B. Smoove did not play J. Jonah Jameson",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Cinema Sins:",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "1. Someone had to see Peter running around trying to destroy Hydro-Man in Venice without his suit. I mean really, no one just saw this guy swinging from buildings in the complete public and didn’t take their phone out to take a photo or video? I know a lot of them were running for their lives, but still, this is 2019.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "2. I know that Peter has super strength, but he doesn’t have invincibility, or a body made out of metal. When he hit the church bell hard with his head twice, he definitely should have had scars and have been knocked out for a while.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "3. How come the illusion tech that MJ found didn’t go off when she was putting it in her bag, but it went off when she took it out to show Peter?",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "4. Mysterio did not transfer all files and security stuff on Edith back to Peter so how is Peter able to use Edith again after beating Mysterio, as if he was the owner? Since he gave it to Mysterio, Mysterio should need to give him permission and confirmation like Peter did, right?",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "5. You’re telling me no one died from the drones (other than Mysterio) during all the destruction? Not one person from the carnival and not one person from the scene in London? Mysterio even said there will be a lot of casualities, but when Peter was walking around after beating Mysterio, there were no dead bodies to be seen.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "6. Why would Peter have walked around in his Spider-Man outfit without the head mask on after beating Mysterio? I know it was to make a cute moment with MJ, but anyone could have run up and seen him.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "7. How tf did MJ even find Peter? I mean he could have been anywhere.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "8. If Nick Fury is so paranoid than why would he let a skrull take over for him on such a major mission?",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "9. How was Happy confident that Nick Fury had got his coded message? What if Nick Fury hadn’t got it?",
          "indent": false,
          "type": "paragraph"
        }
      ]
    },
    {
      "id": "avengers-end-game",
      "title": "Avengers: Endgame",
      "date": "2019-04-24",
      "img": "https://live.staticflickr.com/65535/48012535296_a3878d12e0_b.jpg",
      "img_position": "0 5%",
      "img_credit": "Flickr",
      "rating": "/assets/ratings/5-stars.png",
      "indent": true,
      "content": [
        {
          "text": "Well, I watched Endgame last night. Lemme say it really was like the best movie ever. OBVIOUSLY, DON’T READ THIS IF YOU HAVEN’T WATCHED ENDGAME YET⚠ It was amazing, and that’s coming from someone who hasn’t even seen half of the MCU movies. It just had a sense of closure and so even without knowing the whole story, I got what was going on and how meaningful each part was. Especially after reading comments after the movie from people who had seen more/all the movies. I didn’t finish my pre-Endgame writing in time bc I had a lot to do yesterday, but……I don’t know where I was going with that. I was just informing, I guess.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Iron Man did die as expected, but I still don’t know why that Ask FM guy had to be an asshole. I’m still not gonna respond to him. Iron Man died nobly at the very end though. It was because he snapped his fingers with the stones and being just human, he wasn’t strong enough to take it. Tom Holland amazed us all with his acting again at the Iron Man dying scene, which brings me to another one of my predictions coming true. All the heroes did indeed come back. All except Loki, who was gone as expected, but I’m not actually sure about Gamora. Gamora died and can’t come back, but since they went back in time and then went to the future, Gamora from the past is now living in the future and I guess has no recollection to anything that happened in the last years (Idk the exact count, but it has to have been a while).",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Basically, how they beat Thanos and fixed everything was that they went back in time. Although, not as I or very many people predicted. Instead of using the stones to go back in time, they used the Quantum Realm. I totally forgot about it the other day when I was writing my pre-Endgame entry, but if I hadn’t rushed myself, I probably would have said that I know the Quantum Realm must have something to do with the heroes coming because apparently, Dr. Strange has a lot to say about the Quantum Realm (Tom Holland once spoiled). But I wasn’t sure what. It was basically the main key. I will say though that I did not hear Dr. Strange say anything about the Quantum Realm in the movie though, so idk what that comment was about, Tom. Maybe when I watch it the second time. Who knows when though, because I have no friends. Anyway, they tried to use the stones, but Thanos said he used the stones to destroy themselves, so they no longer existed. With that, Thor killed him by slicing his head off. Then a rat saved the day five years later by running across Scott’s yellow van with the Quantum Realm machine contained inside and made Scott pop out of the Quantum Realm. No one saw that coming haha. Scott said it only felt like 5 hours, but it had been 5 years. That made him realize that if they could control the Quantum Realm, they could use it to go back in time. Idk how Scott figured that might be possible because it seems the only thing the Quantum Realm ever did was not keep track of time, but somehow this led to the Avengers realizing they could go back in time. They went back in time to recapture all the stones, which they somehow knew on the top of their heads where each one was and what year, and then all came back and then used the stones to snap everyone back. Unfortunately for them, when Nebulla and one other person that I’m forgetting right now went to Thanos’s place (I don’t remember the name) to get a stone, the Nebulla in the past sensed that there was another Nebulla there from a different time period (Nebulla is a cyborg), so then Thanos found out they were they and put together everything. The bad Nebulla switched with the good one and brought Thanos into the future with Gamora and current Nebulla, I believe. Then I’m not really sure what happened or where they were, but Thanos was trying to this time snap everyone away and then create his own people who weren’t unappreciative of his snap, he once again tried to fight all the still living Avengers and almost won, when all the others came back because the reversing the snap had worked. Then everyone was back, and they had a final fight against Thanos. Somehow amid the fight, Iron Man got the stones from Thanos without Thanos realizing, so when he snapped, nothing happened and then Iron Man snapped and made all Thanos and his bad guys disappear. Then Iron Man died.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "I have to say; Marvel did a really good job being sure to surprise everyone and still have a proper closure. I feel like it has to have been a struggle because you want the movie to end the way it should where everyone is melancholy, but at the same time, you don’t want everyone to know what’s gonna happen. I read several fan theories before and I was pleasantly surprised that none of them were correct. Really no one could guess how everything would happen. No one saw Black Widow dying (which I was really sad about), no one saw Cap living in a different timeline until he grows old, no one saw Cap fighting his old self to get a stone, no one saw Thanos dying in the first like 10 minutes, no one saw years passing, no one saw Gamora coming into the future from the past, no one saw everyone -- every single hero, fighting Thanos again…., you get the idea. Just so much of the movie was unexpected, which made it amazing. And then there were all the references and small easter eggs in previous movies all came back in the end and the whole movie really felt like closure. It just makes me love MCU even more. I was surprised there was no “In living memory in Stan Lee” at the end though. I am a bit confused though because I read an article recently saying that either Feige or the Russo Brothers had said that actually Far From Home is the last movie in Phase 4, which honestly doesn’t make much sense because it really feels like after Endgame should start a new era. All the main heroes are gone now, time to begin something new. There was even no after credit scenes in Endgame, so it really was like ‘the end.’ Putting FFH in Phase 4 just doesn’t make much sense, so I hope that’s not true. I’m hoping that was just said to through people off about what time period the movie was from so that there were fewer Endgame spoilers. But idk. We’ll see, I guess.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "But overall, the movie was just awesome and very inspiring, and it had the right amount of humor, sad moments and melancholy feel and it really makes me wanna watch all those past Marvel movies since 2008, to catch up. I’m seeing the movie again next weekend and I already can’t wait.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Cinema Sins:",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "1. So, all Peter, Ned, MJ, Flash, Betty Brant… you’re telling me they all happened to get snapped? I mean sure, I guess, it’s just a very convenient coincidence. Nonetheless, I’ll allow it because I would rather they’re all in school together than all different ages.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "2. If the Quantum Realm doesn’t keep track of time, how did Hope’s mom age in the Quantum Realm? She was gone for like 15 years maybe, but wouldn’t that just be like 15 hours in the Quantum Realm then? She should have come back looking the same as she did when she entered.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "3. If all that going back in time does is create different timelines, they aren’t the Avengers just ruining their own lives in different timelines then? Does that not matter to them? What if someone’s life sucked, could they just go into the Quantum Realm and go back in time and then kill themselves in that time period and then just live on with their lives in that timeline now? I guess that’s sort of what Cap did.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "4. Was there a time limit to how long everyone could be gone and get the stones by? Because they all arrived back at the same time somehow, although I don’t recall anything being arranged. Shouldn’t they all have been rushing a lot quicker if they had a time limit? Like Black Widow and Clint were sitting up there or Vormir with the Red Skull for how long?",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "5. If the stones are so powerful, then why didn’t each have a very costly price like the soul stone? How come it’s only the soul stone that is super protected like that?",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "6. Why was Cap the only one to go back? Returning them is just as dangerous as getting them, isn’t it? So why are they now much less cautious?",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "7. And how is Cap gonna inject that stone back into Jane Foster?",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "8. Where was Captain Marvel all that time? She helped them in the beginning and then dipped and then came back in the end. Was she just living in her own world that whole time, while all the Avengers were suffering?",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "9. How did Captain Marvel know where to save Iron Man and Nebulla? Fury started calling her, but then vanished and never had time to explain anything. I realize that she scours space looking for bad guys, but space is HUGE. Do you really want me to believe she just happened to find Iron Man in time? And that’s pretty lucky that Nebulla decided randomly to put him in the front seat of the spaceship then, right?",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "10. No ending quote recognizing Stan Lee.",
          "indent": false,
          "type": "paragraph"
        }
      ]
    },
    {
      "id": "us",
      "title": "US",
      "date": "2019-04-15",
      "img": "https://upload.wikimedia.org/wikipedia/commons/0/09/SXSW_2019_8_%2846611809024%29.jpg",
      "img_position": "0 40%",
      "img_credit": "Wikipedia Commons",
      "rating": "/assets/ratings/1.5-stars.png",
      "indent": true,
      "content": [
        {
          "text": "I know a lot of people liked this movie, but imma be honest. It fell short for me. A lot of people respect Jordan Peele because of his old YouTube videos and his last recent/first movie Get Out. Get Out was a great movie. But just because Get Out was good doesn’t mean this one was too. I get ultimately what I disliked about it was that it put so much focused into getting out a message, that it lost its practicality (even in its fictional world). There were a bunch of holes in the story that just never got filled in by the end of the movie. I would overall give it 1.5/5 stars.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "I guess one could say “this is a horror movie, they aren’t normally realistic at all, it’s just entertainment. The important part is that the message showed in the movie,” but I guess my frustration was the fact that it was Jordan Peele. He did so well before, so I walked in with high standards. The man is a genius, so I expected another genius movie. More personally, I prefer movies that are realistic in a fictional sense. What I mean by that is for example, in Harry Potter, they have wands and cast spells and do magic so obviously that is not realistic, but it follows a realistic sense in that if Harry point his wand at a cup and said that “aguamente” spell that conjures water, the cup wouldn’t just disappear. If it did, that would be pretty unrealistic in even the Harry Potter world because they have their own physics which need to be abided by. If there were no rules, it would ruin the story completely because everything would just happen convenient to the plot and there would be no problems and then no story (and in some of the movies, that almost happened). So, I felt that Us didn’t even follow its own physics, which were mostly the same as ours. It was like Get Out in the fact that it was set in modern time and the people acted like humans and had realistic reactions when communicating, but where the two movies differed was that in Get Out, it’s like that story could have really happened. Everything was plausible (except for being able to put one soul in another’s head and having that work – that was the fictional essence). The power of the movie was that it was real in story, practicality and sent a powerful message about our society. The same one Chris Washington was living in except for the racism was a little less discreet there with the black body switching. In Us, the movie couldn’t be imagined in real life at all. It had a message that related to our present world, but the fictional aspect didn’t show that message in a genius way that exemplifies our society like Get Out did. The whole idea just wasn’t realistic in the setting they set the movie up to be in. So that took away from the movie for me. It had nowhere near the power Get Out had and the cinema sins count just went way over the top. After watching the movie, I turned to Wayne (because I have no friends) and told him “I didn’t get it” and he replied that he didn’t either. So that was a big turn-off for me. I don’t like a movie that is like a scavenger hunt to put the story together. I like it where it all makes complete sense once you finish the movie, but then you if you decide to look deeper, you can and maybe you will find a lot more, just like with Get Out. But the overall message is clear by the end and nothing is left questioned.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "I think Peele was hinting that Jason had gotten switched too, most likely the last time they were there. I don’t know how it really could have worked logically, but the sand tunnels, the snapping at the end, he wasn't eating, he couldn't remember how to do the magic trick, he couldn't remember where the bat was, the family was commenting about his new vocabulary and I think at some point in the movie someone mentioned that Jordan hadn't been the same since the last time they were there, and he took the rabbit back with him at the end -- Jordan Peele is a genius so everything he puts in his movies is purposeful. I'm sure Jason didn't take back that rabbit just because he randomly wanted a pet rabbit from a place where someone tried to kill his mom. I think that last eye contact with them means that Jason somehow got switched too and had been tethered the whole movie. It does not rug me right to leave something completely open to audience opinion at the end of the movie though. Some people say Jason wasn’t a tether because that makes no sense and both theories are completely true. You can’t fully dispute either one. I have a feeling Jordan Peele is never gonna tell us his real intentions about Jason in fact, I don’t even know if he knows himself. So, I don’t appreciate that. It just leaves a big hole in the movie that one will never be able to satisfy.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "So, what exactly was the message of this movie? I had no idea once I first saw it, but then after reading some explanations of the ending and the movie overall, it started making more sense. I saw what the movie was trying to say. I’m under the impression that the message of the movie is all about how it's not that there's a good side and a bad side, there's just a more fortunate side and a less fortunate side. The less fortunate side grew up without proper communication or food and had to kill rabbits to eat. They were mad that they had to live this terrible life while the others could live so much better, so that's why they came up and killed all the upper side. To get revenge for being left down there. An example is when Red switched with Adelaide, she wasn't crazy anymore. She didn't kill things and she talked English and lived a normal life with friends and family that she cared about very deeply. Just like a normal mother. This also explains why so many people’s “kids being half-tethered” theory makes no sense. The kids being biologically half-tethered shouldn't do anything to them. It shouldn’t make them violent. No one is born violent. The tethered people living underground are just violent because they lived trapped in that small space being angry and killing rabbits all their lives. Because the kids didn't, they should not be violent or anything like the other tethers living down below. Red shows some signs because she used to live down there, but now she is mostly normal.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Cinema Sins:",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "1. They treat the escalator going down to the clone’s room like some type of automatic plot-convenient switching elevator. Like how is it always conveniently moving in the same direction as the person coming wants to go? It’s going up when Adelaide/Red wants to go up and going down when Adelaide/Red wants to go down.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "2. If there’s only one person in the whole U.S that the government’s cloning goal was successful for, the likeliness that that one person is someone who has a family tradition of going to a cabin nearby the one entrance to the basement every summer is VERY slim.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "3. If the “Find Yourself” attraction was no longer in use at the part, then why wasn’t it locked? If it was a secret government project, it surely would have been more protected/hidden even if it had failed.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "4. When the clone family first got to the Johnson’s house, why did they just stand out there for so long? How long did they plan to stand out there before going inside? I get that they went there at 11:11, but was there any plan as to when they would all come inside?",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "5. Why were the clones able to tell where their original human was? That was never explained.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "6. This is America, there would definitely be people with guns who would shoot down the clones before they got to them and killed them and their family.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "7. You’re telling me that the boat motored away and then just came back by itself? *Queue Jeremy’s laugh*",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "8. I get that the clone sister is fast because she runs track, but shouldn’t the real sister be just as fast? The clone copied the sister’s movements, right? So how can she be faster than the real sister if they have ran just as much? Especially because the real sister had an appropriate diet and clone did not. And where did the clone practice anyway? In that small basement? That basement doesn’t look big enough for someone to be running track. Surely, she was running into walls then and should probably be dead from injury by now.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "9. Exactly how many clones were made? The movie gives the idea that there’s one for everyone in the US because they make the line across America, but that basement for sure doesn’t look big enough to accommodate that many people and also have that much room for people to be walking around like they were. There would need to be sooo many bedrooms. And is there only one way out to the upper side of the world? Because if so, it would take a lot longer to get everyone the clone of everyone in the US up and out of that basement.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "10. So, was that one guy on the beach just standing there with his arms out for hours/days just waiting for everyone else to kill their counterparts and come? Because I’m pretty sure that’s impossible to be holding your arms up like that for so long, even for a clone.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "11. I really don’t get the whole Jason controlling his tether. In fact, I don’t get any of the controlling tbh. If the tethered were all controlled by their upper parts, then how did they escape the basement? How were they not being controlled anymore? Why was Pluto still being controlled but no one else was? And shouldn’t the real version be controlling the tethered? So okay maybe Jason was tethered (switched at some point), but still doesn’t explain why Pluto was the one being controlled still.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "12. And Peele seemed to really be pushing hints that Jason was tethered at us but then how could he have learned English so fast? And why was the real Jason acting like a dog so fast? So, what was the story there? I don’t like how Peele left that unclear.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "13. Logistically, how could this clone rebellion even happen? Like where did the funding for the jumpsuits and long scissors come from and how did Adelaide/Red communicate to the clones about what to do and what sizes everyone wears? They don’t speak any language.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "14. So, what do the clones do now? They all escaped, killed their upper-selves and now they’re just holding hands across the country. Are they just gonna stay like that forever? How do they know when it’s time to stop? And why was everyone but Adelaide included in the Hands Across America? Did she just say, “you guys all do the holding hands part and I’ll just stay down here in the basement”? I mean she couldn’t have known that Red was gonna come from the start because their plan originally went awry. They were gonna kill everyone at the cabin, but the Johnson’s got away. By then clones had already started holding hands.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "15. And that gets me to what do the Johnson’s do now? Just live in America with a bunch of clones. They are all so happy they escaped, but don’t they realized that all their friends and family are probably killed now if the clones are killing their original? Their only option is to move to a new country now. Unless the clones just stay holding hands forever, then the Johnson’s can all live on earth all by themselves with all the money and food they want.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "16. Why does Adelaide walk all robotic now? When she was walking, she was super calm and turned sharply. Not walking like a human at all. She is a human and even more, was never a clone so shouldn’t she be walking normally?",
          "indent": false,
          "type": "paragraph"
        }
      ]
    }
  ],
  "tech_reviews": [
    {
      "id": "macbook-air-m2-review",
      "title": "Apple MacBook Air M2 Review (moving from Windows to Apple MacBook)",
      "date": "2023-12-25",
      "content": [
        {
          "text": "I bought the MacBook Air M2 in March 2023 when I learned that coding is a better experience on MacBooks. There are less issues with installations and the built-in terminal when using a Mac. And I have to say, I have not run into problems like I did on my HP Envy (Windows) device on the MacBook while coding. There are some things I like better about the MacBook, but then some things I like better about Windows devices. Btw, I’m using MacOS Ventura (from Windows 11 on my HP), and when I bought it in 2023, it was the latest MacBook Air M2 that one could get.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Looks / Build",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "The variant that I got isn’t very stellar in looks imo. It’s super flat and rectangular like a slab of cardboard. It doesn’t look very premium which is a little surprising to me for an Apple device. I wasn’t surprised about the looks/build when I got it though because I had tested this computer out at Costco a few weeks before getting it. The device is a dark bluish color (‘Midnight’ I think is the official name). I can’t remember if I had color options or not when buying, but it’s not a bad color. I think this color and design might be a bit unique for MacBooks though because one tech friend I have said, “what is that?” when I took my MacBook out and then another friend later said something similar to “Apple makes black laptops?” I’m not super used to MacBooks so I don’t know what colors options they have had in the past. I think I’ve seen like dark gray, light gray and maybe a pinkish color…. The computer itself is very thin, in fact, it’s the thinnest computer I’ve ever had. It’s possible I might buy a case for it since it’s so thin. So, it doesn’t look fancy at all and doesn’t look very similar to other MacBooks I’ve seen. It’s almost like someone else designed it and then gave it to Apple. I much prefer the build of my Dell XPS 13 and HP Envy x360.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "The keyboard is alright. Nothing special. I think I prefer the keyboard to both my Windows computers better, but I don’t have any significant complaints about the MacBook keyboard. The two minor things are I hate are the mini arrow keys (like if you have room to make them bigger, why wouldn’t you make them bigger wtf. I keep missing the arrow keys because they are so small…pretty annoying), and the sound of the keyboard. I have never minded the sound while typing on the computer myself, but I remember I always used to hate the sound of other people typing on MacBooks at school, and I’m sure this one is no exception. I will note that right now, I choose to use my HP to type this review. I also will say, I haven’t gotten very used to either my MacBook keyboard or my HP keyboard, meaning I still make constant typing mistakes with them and reach for keys only to hit the key right next to the one I want…but I think that honestly just says more about me than the computers themselves.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Then, there’s getting used to the cmd/ctrl buttons being in different places. The cmd key on the Mac is basically the ctrl key on Windows, so they work similarly, but I think the key placement is better on Windows devices than on MacBooks. It’s a better feeling for me to be reaching from the bottom-left of the keyboard than right next to the spacebar (because the cmd/ctrl keys are normally paired with other keys to get certain functions). I think the placenent on the Mac has to do with having both the ctrl and cmd key, so they needed to position them in a way that was comfortable to press both of them at the same time for certain functions. I honestly don’t see the point in having both a ctrl and cmd key though. But at least the MacBook has 2 cmd keys unlike my HP 🤷🏾‍♂️. This is a minor complaint, but I also don’t like the fn button for emojis. It’s laggy and doesn’t always work. I had to bookmark an emoji page on my browser now on copy emojis from because trying to use fn to make them appear was irking me too much. The Windows shortcut (Windows key + .) is a lot more reliable and never got to be annoying experience for me like on the MacBook.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "The trackpad is fine. I had to get used to two-finger clicking rather than right clicking (even though I think I could change that in settings if I wanted to), but now that I’ve gotten used to that, it’s not that bad. I’ve started doing the two-finger clicking on my HP now too which honestly isn’t the best because it’s more of a hit or miss on that computer. It’s like sometimes it recognizes that I’ve two-finger clicked and sometimes it takes it as a single-finger click. I think the trackpad on the Mac feels better when using it than the one on the HP Envy, and my old Dell XPS’s trackpad doesn’t even always work, so Apple wins that one.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "The screen on the MacBook is taller than the screen on my HP and Dell and I do notice the difference a bit. It’s not a big change, but it is nice to have a bigger screen. I get all my laptops at 13” because they are cheaper that way and easier to travel with, but the 13” screen real estate on my MacBook Air is very pleasant. I do wish it had a touchscreen like my other devices have had, but it’s okay that it doesn’t. The only difference it really makes for me is when signing my signature on online forms and then testing out how my web applications would perform on mobile with touchscreens. I had to clone my code down to my HP and run my applications there to test the touchscreen screen experience because I couldn’t do that on the Mac.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Performance",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "The performance on the MacBook Air M2 is great. I have not run into any lag issues on the MacBook. No freezes or black screens as far as I can remember. The fan runs a bit sometimes, but definitely less than both my Dell and HP, so it is not a noisy computer or one that gets very heated.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "One thing I’ve noticed is that video sizes are smaller on my Window computer and Android devices than they are on the MacBook for some reason (I have not tested this with transferring files to iPhones). I transferred a video from my HP that was 552MB and on my MacBook it is now 579MB. I looked this up and apparently, it’s because media is measured a bit differently between the operating systems (Mebibytes vs Megabytes). Interesting. But it’s still the same size file, so that’s fine then.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Software",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "The software is ok. It’s hard being so used to Windows and then moving to Mac. There’s getting used to the individual window controls (close, minimize, full screen) being on the opposite side, but I think I’ve gotten used to that one now. I actually think I prefer its location on the MacBook. It seems more logical on the left side.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Something I noticed right away when using the Mac is the scrolling. It’s opposite scrolling than what I’m used to on Windows devices. On Windows, you scroll up to go up and down to go down. On Apple, it’s the opposite. It has you scrolling down to go up and vice versa. This was a problem for me because I am so used to it being the other way, so I downloaded an application “UnnaturalScrollWheels” from ther0n on GitHub to fix this (no, this is not an ad). This made it so that scrolling is the same as on Windows devices for me. I have to manually turn the app/setting on every time I restart the computer, but it’s okay as long as my scrolling is back to “normal” after that.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Another thing I’ve noticed, is it’s not as easy to split-screen on the MacBook as it is on Windows computers. With Windows, I can simply drag a window to the side of the computer to split-screen, but there’s just extra steps on the Mac. I can even do 4-way split-screening if I wanted to on my HP but cannot on the Mac. I also don’t like the switching between apps (window management) experience on the MacBook very much. I don’t mind the ctrl + left/right arrow keys to switch between full screen windows, in fact, I kind of like that option. But I don’t like all my open apps cluttering onto the taskbar whenever I minimize them. It just feels cluttery and messy to me and I don’t need all my open apps displayed like that. I know I can turn on the option of not having the apps go into the taskbar when minimizing them, but that’s actually just even worse because then I have to do the extra step of right clicking (or two-finger clicking actually on the Mac) an app on the taskbar and then reading the list of open windows combined with all their suggested windows and I don’t like having to read through everything to find my window every time. Again, it’s these small extra steps that become tedious when having to do them all the time and it makes a big difference when you don’t have to. I like being able to just hover over an app on my taskbar on my Windows computers and see the preview of all my open windows there. It’s easy to view, quick, and feels a lot less cluttered to me. Not even the cmd + tab is very helpful because it doesn’t show my open windows, and ctrl + up arrow only lets me switch between tabs that I have not minimized. I’ve tried many different commands and settings, and nothing beats the multitasking of Windows computers so far. For me, Apple just needs to clean that up. (DockView is an application that can make window management similar to the Windows experience on Mac, but it’s third party and it costs $20+).",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "In general, the MacBook is a lot more command heavy than the Windows computers I’ve used and since my memory isn’t great, it gets a little annoying having to constantly look up certain commands to do certain tasks. But once you get the hang of them (if I ever do), I imagine it’s probably a pretty fast and smooth experience, maybe even more so than with Windows for some people.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Lastly to note, I don’t know about Finder on the Mac. It runs faster than File Explorer does on Windows in my experience, but it’s not as advanced it seems. I don’t like how I have to press a button to make files organize themselves instead of the computer doing that automatically, and I don’t like how little info it shows about selected media. Like I can’t even view the frame rate of a video unless I open the video and go to some settings in the QuickTime Player application. And for VLC users, I can say from my own experience, VLC works better on Windows. It gets laggy on my Mac. QuickTime Player…does anybody like that sh*t?",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Overall, I think the software is pretty good on this MacBook Air though. There have been multiple programs that I’ve tried installing on my HP that did not go well that I was able to install on my MacBook Air with no trouble at all (all from the terminal), so that’s a win.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Camera / Sound",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "I noticed right off the bat when testing the MacBook Air, the speakers on it are WAYYY better than any Windows computer I’ve used. Like you can really hear the bass and everything when listening to music on it. They sound rich and are probably the best speakers on any device (computer or phone) that I’ve used so far. The camera is also the best camera I’ve used on a laptop so far. When I switched from my HP to the Mac, someone I had weekly online meetings with told me that my sound quality was a lot better (there wasn’t this background noise and foggy sound like there was on my HP I guess) and that they could see me much more detailed now. I hadn’t realized the quality difference myself because I don’t have video meetings with myself, but apparently it was a big improvement.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Conclusion",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "In conclusion, I really like the MacBook Air. It does what I needed it to do and so I believe it was worth the buy. It’s different than my Windows devices, but that was expected. I knew there would be things I liked better about it and things I preferred more on Windows. I have not used any other MacBook computers, but I think this has been a good first experience and I’m glad to be part of the MacBook ecosystem now. I would recommend this device for Apple users, power users who aren’t gamers (because there are probably better gaming laptops specifically for that) or computer programmers.",
          "indent": true,
          "type": "paragraph"
        }
      ]
    },
    {
      "id": "s9-in-2022",
      "title": "Galaxy S9 in 2022",
      "date": "2022-01-19",
      "content": [
        {
          "text": "Okay, so I got my Samsung Galaxy S9 in 2018 as a spontaneous gift from my dad when we went to an open house for UC Irvine at the mall. From then on, I loved that phone-- everything about it. The performance, features, customization…. I loved it so much that even when I got my Galaxy S20, I wanted to keep my S9. Now, I can say the S9 gave me a good four years of service, but it has worn down to the point where I believe I could no longer use it as my main driver if I wanted to in 2022. Here’s a deep dive into why.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Performance",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "The amount of ram this device had was always a strong point. I think I remember being amazed by how well the device’s memory was. But now in 2022, I’ve noticed a couple of times where I open an app, and it has to restart. It happened only yesterday that I was typing a comment into YouTube and switched to my browser to look something up, and then when I switched back, YouTube refreshed, and I no longer had my comment (I had to retype the whole thing). I ran a quick speed test with my S9 and my iPhone 8 today, and the iPhone 8 won in all apps except Instagram, YouTube and OneNote and there were a couple of ties. The S9 struggled with a lot of lag when trying to open apps. The phone was once faster than the iPhone 8 I believe but definitely not anymore. For a memory test, the S9 had to do twice as many app refreshes as the iPhone 8 did. Some info to note is that the iPhone 8 was released in 2017 (and is currently running the latest and greatest IOS software, IOS 15). The S9 was released in 2018. The constant stuttering and lag are a regular ordeal for the S9 these days. I can’t do pretty much anything without having to deal with it which is the main reason I just couldn’t stay with my sim card in the S9.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Software",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "Another reason I no longer find this phone suitable as my main driver is because of the lack of software updates. In 2022, the latest Samsung One UI version is 4 (which still hasn’t come to my S20 yet in the time that I’m writing this review) which runs Android 12. Although, my S9 stopped receiving updates in 2020 so it is stuck on Android 10 and One UI 2. Because of the lack of updates, there are minor differences with how the S9 functions vs. my S20 or any Samsung running the latest software, and some of those differences I really value on my S20. For instance, on my S20, I can pin apps on the share screen. When I want to share a photo or file, I can pin the apps that I typically share stuff to at the top so that I don’t have to scroll through the list of options. Interestingly, my S9 used to be able to do this but lost this feature among one of its updates and that’s a shame because it was a feature I used frequently. Another small factor I miss when switching to my S9 is the newest gallery update. With the updated gallery app, I can edit photos, and then the photo will stay edited unless I revert it to its’ original. On the S9, when I edit a photo, it creates a 2nd version of the photo, so I have two of the same photo, one edited and one not. Then I delete the original if I don’t want it which, typically, I don’t. That’s just one way the gallery app is more user-friendly with its latest updates, and it’s simple things like those that make the phone experience go from annoying to quick and easy. I miss these kinds of features whenever I’m using my S9 and now that I have them on the S20, it would be hard to ever go back to the S9 as a main driver.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Battery",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "The battery is just bad at this point. I have put a new battery in the phone twice now and the 2nd time it really didn’t seem to do much anyway. It drains like a funnel. Even at night when I’m not even using the phone, it will drain at least 10% by the morning. Important to note, this is all without having the sim card in. If the sim card was in the phone, I predict the phone would be unusable. I wouldn’t be able to take it out anywhere without having my phone run dead by the time I got home.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Camera",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "The camera is one department where the age of the phone isn’t showing as prominently, and I wouldn’t expect it to either. This phone had a great camera when I got it and still does. I don’t use it as much though because when I’m taking a picture, which isn’t very often, I’m typically taking them on my S20 or my iPhone 8 these days. But nevertheless, when I do take pictures, they are still quite satisfying. I have noticed missing the object eraser tool in the gallery app that the S20 has though. And there is minor shutter lag when taking a pic, but it doesn’t bother me.",
          "indent": true,
          "type": "paragraph"
        }
      ]
    },
    {
      "id": "hp-envy-review",
      "title": "HP Envy x360 Review",
      "date": "2021-05-23",
      "content": [
        {
          "text": "I’ve had this laptop for almost 2 weeks now I think, so here’s my review. I was pretty nervous before getting this laptop because it was significantly cheaper than the Dell one and the Thinkpad option that I could have gotten so I was scared it was gonna be a lot worse even tho I couldn’t necessarily see why from the specs. I was also afraid it was gonna look ugly bc it’s not a black keyboard like I used to have, and the HP Spectre looked ugly asf. I know worrying about the look of a laptop is the definition of a first-world problem, but if I’m gonna be using a laptop a lot for some years, I want it to look like smth I wanna use. So, I guess I’ll split this review into categories.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Looks / Build",
          "indent": false,
          "bold": "true",
          "type": "paragraph"
        },
        {
          "text": "It looks sharp. The first thing I thought when unboxing it was that “this sh*t looks premium asf.” Just the look and feel of this computer make it seem worth the money. When I first used the laptop, I was not a fan of the keyboard. When writing my Pixel’s journal entry for the day I even said, “I prefer the XPS keyboard.” This one clearly felt different; I felt like the keys go down a bit more and it was kinda wearing my fingers out. After typing just a little bit with it my fingers were tired and I never got that feeling with the XPS not even when in 2018 when I got my first one. But now, after a couple of weeks, I’ve gotten used to this keyboard to the point where I might actually prefer it. Typing on it just feels nice, it’s a satisfying feeling. I find myself purposely not answering some Askfm questions on my phone just so that I can type the answers when I’m in the mood to be on my computer. It took a bit of getting used to the new keyboard layout tho. Like for the first week of using it, I found myself consistently mistyping words bc my fingers weren’t used to where the keys are. On this computer, it’s like everything is shifted to the left from the XPS layout. They moved everything to have the buttons for the home, pg up, pg dn and end keys on the very right, so my fingers would automatically press one button thinking it was a different button after being used to the XPS layout or just any computer that doesn’t have dedicated space on the right for the home, end and so-on buttons. Now that my fingers are finally getting used to this setup tho, I’ve found I really only have one issue with the keyboard. It was smth I was a bit nervous about but didn’t really know how it would really affect me. It’s the absence of the 2nd ctrl button. I miss it a lot. On this computer, they switched out the one on the right side for a fingerprint scanner and I used that one a lot when I was computer coding. I’ve even considered only computer coding on my XPS just so that I can have that button again. Ik it’s picky, but it’s just hard having smth and then not having it anymore bc I got used to it. I really wish there was a way I could remap this 2nd alt key to be a ctrl key instead. There probably is some kind of difficult way if I download some weird software but whatever. I can deal. The last thing I guess I’ve noticed about the keyboard is that bc it’s not black like the keyboards I’ve always had in the past, it can get harder to see when there’s not a lot of light so I find myself using the backlit key options now more than ever. It’s fine tho, it works well—I haven’t had a problem with it at all and it looks sexy anyway, but it’s just smth different than the XPS. One other thing I like about the build of this laptop is the trackpad. It’s just premium-feeling just like the whole laptop is all around. Clicking it is satisfying and it’s not like clicking plastic like my 2017 XPS was like. The clicker is not quite as silent as the XPS’s clicker, but it’s still fairly quiet and just feels more expensive. I am actually quite fine using this device w/o an external mouse (although I always will prefer the external mouse).",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Edit (Feb. 2023): PowerToys from the Microsoft Store allows me to remap the right alt key to a 2nd ctrl key.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "Edit (Jan. 2024): Half of the spacebar no longer works. Only responds when I press down on the right half.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "Display",
          "indent": false,
          "bold": "true",
          "type": "paragraph"
        },
        {
          "text": "Now the display is a little different than my Dell. Things on it are a bit smaller, but for some reason, things also just seem sharper on the HP’s display. I don’t think this laptop is supposed to have a better quality than the Dell XPS (but I can’t remember for sure), but things just look a bit cleaner on this screen. I do wish the screen got a bit dimmer tho. I found myself a couple of times wanting smth a little gentler on the eyes and pressing the dimming button just to find that it’s already at its lowest setting. The XPS might even go dimmer than this one does. I don’t think I’ve boosted the brightness up at all since I got it. But if I press the privacy screen setting it gets much dimmer so that’s like my lower brightness trick.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Performance",
          "indent": false,
          "bold": "true",
          "type": "paragraph"
        },
        {
          "text": "There’s not much to criticize in this department either tbh. There have been a couple of times I’ve noticed where the screen will go black but then it will come back right as if nothing ever happened and there has not been an instance where it was unresponsive at all. The computer always seems to be working and those hiccups only really happened like twice. One thing I am noticing tho is that the computer does seem to run its fan quite a bit. Like today, I haven’t been able to use it at all without the fan going so if you’re someone who doesn’t really like that kinda white noise, this computer isn’t for you. The keyboard doesn’t get that warm, but I noticed the back of the computer where the heat seems to be coming out does get pretty warm. And today I haven’t even been doing that much use on it; I have a lot of tabs open in Chrome, then I have Spotify, Atom, Word and OneNote open, and I guess a couple of File Explorer folders. But the fan hasn’t stopped since I got on. I think the fan has a little more chill on the XPS but it’s okay.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Tablet",
          "indent": false,
          "bold": "true",
          "type": "paragraph"
        },
        {
          "text": "I have only tried the tablet feature on this thing once and it was pretty brief. I already have a tablet and this seems like a clunky a** tablet to use. I actually originally tried to get a laptop that didn’t fold into a tablet so that’s all a long way of saying that the 360x feature is not why I bought this. But since it does fold into a tablet I decided I might as well get the stylus jic I end up do wanting to use it in that mode. It’s aight. As soon as you fold it into a tablet it seems to recognize that you have gone tablet mode and automatically adapts. Writing with the stylus is nice although I found myself not wanting to touch the screen bc I was afraid of getting finger marks all over it and it’s hard to write with the stylus on this thing without touching the screen with my hand. One thing I have kinda noticed tho is that fingerprints don’t seem to show up on the screen that easily and maybe this is bc it is made for that sorta thing. So that’s kinda cool. Still, I did see some smudges stay on a bit so I didn’t really wanna mess with that much more. The laptop can fold into tablet mode while having devices plugged into it though so that’s nice.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Camera / Sound quality",
          "indent": false,
          "bold": "true",
          "type": "paragraph"
        },
        {
          "text": "In my experience, video and sound work just fine on this laptop. There’s nothing unexpected about the video/sound quality. As expected, the video quality is better when there is more light in the room and there’s a slight sound lag when watching videos using wireless earbuds. One thing to note is although you can turn off your camera and mic when you’re not using them, Zoom shows the screen recorder cam when your camera is turned off externally so you can’t really use it as a way to turn off your camera while using the app. That has bugged me a bit because I use Zoom quite a lot.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Edit (Apr. 2023): Apparently, the sound quality on the HP Envy x360 is very flaky and static-y for other people when using Zoom (and probably all other video meeting applications as well). It would be hard to hear me for other people when I talked. When I switched to Mac in 2023, people I talked to on Zoom told me the sound issues stopped.",
          "indent": false,
          "type": "paragraph"
        },
        {
          "text": "Conclusion",
          "indent": false,
          "bold": "true",
          "type": "paragraph"
        },
        {
          "text": "So overall, not a bad laptop at all. Despite a few nitpicks, I can definitely see myself using it as a main laptop. It seems to be a great bang for its cheaper (but not cheap) buck as well.",
          "indent": true,
          "type": "paragraph"
        }
      ]
    },
    {
      "id": "one-ui-review",
      "title": "One UI Review -- 2 Days Later",
      "date": "2019-02-07",
      "content": [
        {
          "text": "Before I start with the whole reviewing, I’m gonna give a bit of background on my whole updating experience. If you don’t care, skip the first two paragraphs to go straight to the review part. I wasn’t planning on getting this update in all honesty. By observing YouTube videos, the new icons looked ugly, the rounded corners were overdone and therefore looked ugly and the biggest deciding factor for me: I would lose all Substratum features. The only factors that had me considering the idea were the gestures option, possibly faster speeds, and the dark mode, and honestly, I’m wasn’t super drawn to the dark mode. Typically, I like dark modes, but it didn’t seem to look all that great on the devices in the One Ui beta videos I watched. So, I decided I wouldn’t go for the update. As the “upgrade” to One Ui date started approaching for the Samsung S series, I teetered on the idea a bit again, as I wanted to be updated like everyone else and have gestures and newer features, but I didn’t want to lose the features on my phone that I valued. I started considering rooting the phone because then my phone would be open to a lot more options and I would still be updated like all other S series users, but rooting comes with risks, which is why I have never pursued the option before on a phone (I rooted a tablet I had years ago back in like 2012). But in the last week, I really started considering it. Then, after a bit of searching, I found that since I have a contract with a carrier, I couldn’t root my phone. I also didn’t want to void the warranty because I found my warranty is still good till June, two months longer than I expected. You never know what might happen. I didn’t do too much looking after that, but I decided that, no, there’s no need to root it. I’m fine with how it is, and I won’t upgrade.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Well, that decision became pointless when One UI automatically updated to my phone. I was just using the phone when I put it down to do more studying and it just started updating. I tried to back out with my back button, and it didn’t work. I was going to be stuck with the update. As you can imagine, I was pretty pissed. Samsung didn’t even ask me if I wanted the update. They didn’t wait till I said it was okay to update, they just pushed it through whenever they felt like it. There should be a law against that for all devices.... This especially got me pissed when the update crashed my phone and repeatedly went to recovery mode. Because of all the overlays I had on my phone from Substratum theming, the update was not installing right and was continuously rebooting the phone. I couldn’t even unlock the device before it would reboot. My only option was to erase app data and go to Safe Mode and backup the device and then factory reset and restore everything. The only thing Samsung did right was backup my device automatically earlier that morning. Perhaps it does that whenever a new update comes. So that’s good on Samsung. If your gonna force updates to your phones, give automatic backups-- that makes sense. The only thing I ended up losing I think, is just some memos. Which I am mad at Samsung for. Ultimately, they should not update your phone unless you give it permission to. But when I say that’s the only data I believe I lost, I mean that. Substratum is now currently working on rootless Samsung Pie. I was like “well, there’s nothing really to lose now, so I might as well try putting these Substratum fonts on the phone just to see,” and to my surprise, it actually worked. I have all my old overlays and fonts on the phone, and I’ve restarted it and even (accidentally) updated Andromeda and the theming is STILL working. Who knows how long this will last and maybe it will end up blowing up my phone later, but for now, it’s working. I need to make sure that I don’t update anything theming app or the phone itself because that could ruin everything. Google Play was having this problem yesterday where it was automatically updating apps even though auto-updates was off. Hopefully, that doesn’t last long because that should be against the law... One thing I noticed is when Google announced that they purposely disabled third party theming (fuck Google for that), they said they did it starting with an update in Oreo that was added into Android Pie. So maybe if that update didn’t affect my phone when it was on Oreo, it’s not gonna do it on Pie? I don’t know. We’ll have to see. But I’m glad that’s it’s working now.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Okay now for the review part. I’m actually digging One UI. I’ve used it for about 2 days now, so I can’t give a super detailed review (which I guess is good because no one would read this), but so far, I’m not hating it. Here are some categories and what I think of them on One UI:",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Styling",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "The app icons aren’t my favorite, but they don’t look quite as bad as I thought they did through the computer screen. I suspected that the actual experience would be different than what you’re viewing on YouTube because the real thing is always better than just a video of it, but I still wasn’t sure I would like having it very much. Of course, after a while, you would get used to it, but still, I didn’t want to have to. I also still have all my old app icons that I changed using Awesome Icons, so it’s cool I didn’t lose those through the update. I don’t know if the app works on One UI yet or not so I might no longer be able to change them, but I’m not planning to delete those icons from the home screen so at least I have those. The rounded corners aren’t horrible either. I do think that the notification panel is a bit too thick for each individual notification and it would be nice to be able to reduce its sizing, but it reduces a little if you pick a smaller font. I also have my screen zoom on the lowest option (which isn’t very low) because, without that, everything felt way too clustered. The rounded corners actually don’t seem that much more rounded than the phone itself, which was one of the ugly designs I noticed in the YouTube videos. So, they are not that much overdone. The only place they are overdone in my opinion is in the gallery app. The album covers are a bit too rounded and there’s no padding, so they touch the edge of the screen and it looks pretty ugly in my opinion. I wish they had styled that better. I really don’t know whose idea it was to take the padding out of the albums. Don’t get how they liked that. Also, I’m not digging the new changes for Samsung Music. I never really liked that app design before and I’m still not feeling it now. For most of the apps, I like the new styling though. The calendar app looks dope now. The roundedness of the app is nice looking and the new set up just makes the app look really clean. I like it much better than the old design. Even the calendar widget is better. The rounded corners really make for a nicer look on the home screen. Moreover, Settings, Messenger, edge panel, Google app, Samsung Internet, Notes…. I think just in general, the rounded corners everywhere are making everything look very clean which wasn’t what I expected at all, so that’s thrilling.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Speed",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "The speed hasn’t improved or gotten worse from what I’ve noticed. There was some hiccupping at first shortly after I had updated, mostly when going to multitasking screen, but that seems to have cleared up because I haven’t gotten any since. And this is coming from someone who uses a lot of third-party overlays over everything including the system ui. One thing I have never liked on my S9 Oreo was that whenever I press the share button, there is a lot of lag. There is still some lag when pressing it now, but I feel like there’s a tad bit less. Maybe the animations just make it look cleaner and less laggy. Idk. So, updating to One UI doesn’t seem to slow down your phone or speed it up. Hopefully, that lasts. Samsung doesn’t have a very good track record with that. We’re all hoping things are different with the S9, as they have been so far.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Battery",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "I haven’t noticed much difference with the battery. I saw some people say that they think the battery is lasting longer while others are saying they have found more battery drain. Personally, I think I would lean more on the drain side, but ultimately, I don’t notice that much difference I don’t think. I don’t constantly use my phone all day unless I’m in my room, which means I’m right next to a charger and I just plug it in whenever I feel like it so it’s not normally a problem for me. I also have this habit of thinking that the battery is too low any time it’s under 70%, so I charge more often than I have to haha. But it would be really nice to have a really good battery in a phone someday. I’m thinking of going for a Note someday in the future.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Multitasking",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "I do miss the card stack layout that we had before and I really think Samsung should have made it an option in settings, but this new layout is not completely horrible. You can’t see your other apps without scrolling now and that’s annoying, but the design that they choose for this not-as-appealing layout works. They do this thing where once you go to the multitasking screen from an app, it automatically shifts you to the left. I saw this first in a One UI review on YouTube and the reviewer said it was annoying and it looked annoying, but actually experiencing it myself, it’s not that bad. Typically, if you just left an app, you’re not gonna go straight back to it. Otherwise, why exit it in the first place. Especially why go to the multitasking screen if you’re not gonna multitask. So, it’s kind of helpful for it to be shifting like that. You’re either going back to the app that you last opened, which is probably what most people do, so it’s a helpful feature or you’re opening something else that you opened earlier so it’s giving you a little boost to get there. I do wish they had the option to go to the home screen from that with having to 3D touch the home button though. Like on iPhones you just tap somewhere out of the recent apps and it takes you to the home screen. Either way, it’s not that bad at all, at least not for me.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Features",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "Not many features were lost with One UI and they did add some new ones. There’s dark mode, which I tried, but I’m personally not digging it much. I’ve heard a lot of other people online say they think it’s beautiful, so my word isn’t really the best to take into account here, but I just don’t like it much. I think it’s more of a personal preference that I generally prefer the white interface on apps. It just looks cleaner to me. But for colors, black any day. As anyone who knows me knows (so, no one), black is my favorite color. #MatteBlackEverything #MarquesBrownlee But on apps, the white interface is where it’s at. Except for Keepsafe. Dark theme is better there. Anyway, the gestures are nice. I’ve been using them all day and I think they are nicer to navigate with than the buttons, but I do like the buttons. I wish they still have the little dot on the left where I could choose if I wanted the buttons to be permanently on the screen on not when I have the button option selected. I do like the new One UI navigation buttons better than Oreo’s, but I used neither because I have a Substratum overlay making my navigation bar the stock Android Pie navigation instead. I like the pill. It’s sophisticated looking if you know what I mean. But the gestures are simple to use, and I’ve been working with them nicely. I really like having that option. That was the biggest factor that made me consider updating to One UI in the first place. Substratum was on a higher tier for me though, so I ultimately choose the gestures were not worth it. Now I have both which is something pleasant in my life after knowing I failed a math midterm today along with the other hundred things that make my life + life in general shitty. I guess just this one little One UI + Substratum pro doesn’t make up for it at all, but whatever. I need something that makes me smile a little bit. Additionally, some new features I’m liking is home screen option to lock apps in their place so they can’t be moved around and the new lock screen option where you can set it to icons only. I think it looks cleaner than having all those notifications hanging down and now people can’t read my notifications if they pick up my phone, so that’s nice. Well, unless they press the icons and swipe down, but that might not occur to them. Plus, no one would probably touch my phone without asking anyway. There’s the option to make apps more transparent when using popup mode. There’s also adaptive brightness now, which I haven’t really noticed much of yet, but I’m curious to keep using it and see how I like it. Some features they did lose though that I used to use other than the left-hand dot for the nav bar, is the option to make apps not have the background on the home screen icons (icon only option) and the option to change the color of the navigation bar.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Camera",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "I’m not a big camera person so I don’t take a lot of photos and I don’t really care about my photos being the best of quality. I just need to be decent quality so one can clearly see the photo and not blurry. One issue I’ve always seemed to have with my S9 and I think with my S6 too, is that if you shake the camera at all while you’re taking a photo, the photo comes out blurry, which has been really annoying, but so far with a little bit of testing, that hasn’t been the case on One UI. I haven’t really tested it out too much, but I just felt like the photo looked clearer. The new design of the app looks a lot nicer too and is just cleaner, like with many other apps. I’m really digging the new camera.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "So overall, I feel like I’m really enjoying One UI. It was a pretty big frustration at first, especially with the factory resetting and having to restore everything and re-login to apps, but then it was like having a new phone. I haven’t really lost anything (except some memos) and most everything looks a lot better than before. I’m glad I got the update and I totally recommend it, although if you don’t already have Substratum downloaded and you decide you want it later after you install One UI, it might not work for you, in fact, I’m guessing it probably won’t. But who knows then because I was guessing it probably wouldn’t work for me with it preinstalled, but it did anyway. For anyone who might be unsure about the update, get it. You won’t regret it. Or at least I’m not. You might, I guess. But I’m not.",
          "indent": true,
          "type": "paragraph"
        }
      ]
    },
    {
      "id": "dell-xps-13-1960",
      "title": "Dell XPS 13 9360 (after 1-year)",
      "date": "2018-12-31",
      "indent": true,
      "content": [
        "Last year I really wanted this laptop. Getting it was like the make or break of my Christmas (although it wasn't Christmas when I ended up getting it). I was just tired of having the old laptops that hardly worked and crashed and were super slow: my Thinkpad from Girls Who Code and the Samsung one I bought when I was 12. When I found out I was getting the computer after some snooping around (because my impatient ass was being impatient), I started looking up YouTube reviews on the computer. This is when I found out about something called “coil whine,” that apparently the computer tends to have a big issue with. I started kicking myself for not watching these reviews sooner, as I had only done some Google searches and liked how Eli’s computer (the same one) worked. It was called the best laptop of 2017 by many websites, so I figured it would be great. Naturally, I began to freak out about possibly getting coil whine on my new computer. It was too late now to look for a new computer. Not just reviewers, but people in the comment sections were complaining about coil whine too. It was the first thing I checked for once I got the computer. I’ve had the computer for almost a year now and still, you cannot hear the coil whine at all unless you put your head on top of the keyboard (which nobody does), so that ended up not being a problem. But the computer isn’t problem-free even if the coil whine was not an issue.",
        "The first thing I noticed was that the keyboard isn’t very comfortable. It was a lot smaller than I was used too, although that’s just me picking the 13 in over the 15 in (so keep that in mind if you’re thinking of switching from a 15 in or more to something smaller My fingers felt crammed asf while typing. I’m used to it now though). The keys are hard and don’t press down very much, making your fingers hurt faster after typing for periods of time. The keys have become looser throughout the year, but still, I think I would probably prefer the Mac keyboard which I’ve heard is very comfortable. The backlit keyboard is definitely nice to have, but I’ve noticed recently that it doesn’t turn on when I move around a connected mouse. It doesn’t stay on permanently, it goes off after a few seconds which makes sense -- saves battery. But the only way to make it turn on is by pressing the keys and since you can’t see the keyboard, you have to randomly press a key (unless you can locate where the key is in the dark) and then delete it after whenever you want to start typing. I swear it used to turn on when you wiggled the mouse. I don’t know If this is a bug that can be changed or what’s happening. I’m sure I can probably make the backlit keyboard stay on permanently in the settings somehow, but I feel like that’s wasteful and the keyboard should just be working better without having to tweak the settings.",
        "I quickly found out after getting it, that my laptop had this bug where it would crash and tell me it needed to restart. I had to constantly save my work or hope the computer saved my work because I never knew when it was going to decide to randomly crash on me. I dealt with this a few months before finally doing a thorough search for how I could fix the problem. All it seemed to take was one simple update. So, I did that thinking “whew, now I won’t need to go through this again.” Unfortunately, though, it still crashes on occasions. Everything goes blue and it tells me I have to restart the computer. Then I lose everything. I don’t know if that’s ever going to completely go away.",
        "Another issue I hate is the trackpad. I only learned this year that I could scroll up and down using the trackpad (which is completely my fault, I’m sure it’s a common computer thing that I just was oblivious to all this time) and now I use it to scroll quite a bit. About 30% of the time when I’m using it though, it does this weird thing where it either takes me to my recent tabs screen or to the home screen. The reason it does this is that if you put 3 fingers on and swipe up, it goes to recents. If you put 3 fingers on and swipe down, it goes home. But the trackpad is so jumpy that it’s like it had no control. It will do those actions even if I use 2 fingers. I just want to scroll up and down and it’s annoying being taken somewhere else that I did not ask to be. I think the trackpad is a common issue. I’ve seen a comment or two about it on YouTube.",
        "Moreover, there’s the brightness. It doesn’t get as low as I would have liked. It has Night Light (blue filter) which I typically keep it in all day because I’m always tired, but it doesn’t get very dim. I think this is kind of common for a lot of Windows laptops (but don’t quote me on that because that might not be true). I’ve also heard a lot on YouTube about the sound quality not being great, but that’s something I have not noticed to be an issue. The sound, at least on my computer, has always sounded fine – loud and clear.",
        "I was studying for a final earlier this month with a “friend” and a few of her friends and one of us happened to have the same laptop. We bonded for all of about a minute because we both agreed how much it sucked. Okay, it doesn’t suck, but it’s not all it’s cracked up to be if you’re watching or reading reviews that say it’s the best. And she brought up how she tried to return it and had issues with the support service. So apparently, I’m not the only one to have issues with this laptop that weren’t just coil whine.",
        "All this being said, it’s not a complete bust. As reviews said, it is very fast. I’ve had some issues with staying connected to the Wi-Fi a lot in my house, but I think that’s more of a “my house” problem than the computer. It hasn’t been an issue at my school. It heats up sometimes, but never too much. The screen does look nice (except like I said, I keep it on Night Light all the time anyway) and it does have the Windows perks. Then again, there’s random crashing/restarting, uncomfortable keyboard, annoying trackpad, not the best company support, backlit feature not working right and lack of brightness controls, which can be annoying if you’re up late at night.",
        "You can find a lot of reviews on YouTube for this computer and if you look into the comment section, I’m sure you’ll read a lot about coil whine being a common issue, but this is my take on the laptop. We all have different experiences so maybe I’m just unlucky, but I’m just here to warn for whoever’s going for this computer, do so with caution. This is what you could possibly face. Of course, it’s still a fine working computer and we should probably all consider ourselves spoiled to even have technology like this in the first place, but getting past that, it’s not the best laptop you could go for. I wish I could have read (or watched) something more like this in reviews when I was looking. I would have probably gone for something else if I had."
      ]
    }
  ],
  "vs": [
    {
      "id": "apple-google-spotify-napster",
      "title": "Apple vs Google vs Spotify vs Napster",
      "date": "2019-12-18",
      "img": "https://images.unsplash.com/photo-1499415479124-43c32433a620?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2664&q=80",
      "img_position": "0 47%",
      "img_credit": "Simon Noh on Unsplash",
      "content": [
        {
          "text": "I’ve used all four of these music apps very intensely on both IOS and Android and here is my review/comparison on each of them. First, I’ll say that all of them require accounts so the music will sync to any device as long as you login to your account. Furthermore, they all have the capability of downloading songs for offline use, although they download them into their own proprietary formats so that if you logout or unsubscribe, you can no longer access your downloaded music. They all have support for creating and sharing/publicizing playlists and makes their own in-app playlists for the most popular music of the current day, the year, different moods and different genres. People who don’t own the music service cannot view a shared playlist though.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Apple Music",
          "indent": false,
          "bold": true,
          "center": true,
          "type": "paragraph"
        },
        {
          "text": "For me, Apple Music is the best on IOS. I like how a user can move music that’s stored on their computer (mp3 or avi) into Apple Music through iTunes on the desktop and although it won’t match to a song in Apple Music, it will still sync across devices. Apple Music has a good range of music and lets users customize their playlist cover. It can has a nice organized looking interface, but I also feel like the part most people use, the page with all the user’s music is crammed into one small area and then there’s several additional pages that could easily be combined to make a much cleaner looking app. Like the “For You”, “Browse” and “Search” pages can all be one page and then the app would have more room to breathe instead of feeling like all these extraneous features crowding my space. What I don’t like so much about Apple Music is how it how it runs its playlists. The only way you can sort them is through the desktop application which is a pointless limitation. I feel like organizing your playlists is a must because it makes it a lot easier to find the music in them when they are very long. Another annoying thing about Apple Music playlists is that there’s no scroll bar to scroll through long playlists so you have swipe up for a really long time to get the bottom if there’s a song you want to see at the bottom.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "While Apple Music is my favorite to use on IOS, it’s not my favorite on Android because of course Apple had to mess up their app for Androids. Several of the album covers refuse to load when they appear perfectly fine on IOS and same for several artist pictures. I’ve tried restarting the device, updating the app, logging back into my account, closing out the app, and nothing’s worked except uninstalling the app and reinstalling it and then all that does is give me the album and artist art for all my preloaded music but doesn’t guarantee what I add later will have it. I’m not gonna reinstall the app after adding new music each time because then I have to redownload all my music each time which takes a while.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Pros:",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "User can upload their own music files",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Customize playlist cover",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Tells you when you’re about to add duplicates into your playlists",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Dark mode option",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Crossfade music option",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Highlights most popular songs in albums",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Includes syncronized lyrics",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Cons:",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "Can only crossfade music on desktop",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Can’t scroll through long playlists very easily",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Not all album and artist pictures load even when Apple Music does have pictures for them (Android)",
          "indent": false,
          "type": "li"
        },
        {
          "text": "App interface is crowded with pages that I think can easily be combined to take up less space and make app seem less hectic",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Google Music",
          "indent": false,
          "bold": true,
          "center": true,
          "type": "paragraph"
        },
        {
          "text": "I’ll say straight up that Google Play Music is the application here that I’m least familiar with and I don’t have a subscription for it. Waaay back I used to use it with my Nexus 7 and now I use it for YouTube downloaded music, but basically, I’ve always used it for storing my personal music on rather than playing any music from the app. From what I have experienced with Google Music, it’s easily the worst out of four music services for me. I don’t like its interface at all, and I have to cache my personal uploaded files on the app before I can listen to them offline. The interface looks messy and unfinished. I really dislike how when playing a track, the album cover shows up all zoomed in in the app so you can only see part of it and sometimes because of the unnecessary zooming, the part that you can see is blurry….like who’s idea was this?? Google Music is like Apple Music where you can upload your own tracks, but you can only manually transfer your files through an extension on Google Chrome rather than having its own web application. Perhaps the Chromebook has its own desktop application, but not on Windows. Another thing I don’t like about Google Music is how focused it is on radios rather than playlists. I would rather have a playlist where I can see all the tracks rather than a radio where I have to skip through songs.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Google Music is one of the reasons I couldn’t switch fully to Google products. They have me effed over with that app. No Pixel or Chromebook for me.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Pros:",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "User can upload their own music files",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Cons:",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "Interface is dirty asf",
          "indent": false,
          "type": "li"
        },
        {
          "text": "No desktop application",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Can’t scroll through playlists very easily",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Focuses too much on radios rather than playlists",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Napster",
          "indent": false,
          "bold": true,
          "center": true,
          "type": "paragraph"
        },
        {
          "text": "Napster is the 2nd worst out of the four in my opinion, in fact, I hardly use it anymore now that I have Spotify and Apple Music. The main reason I stopped using Napster is probably because the app was always so laggy. It’s not a device problem because it’s been true for my Samsung, iPhone SE, iPhone 8 and PC. All of them open the app slowly and the app just performs laggy and it’s frustrating. Moreover, scrolling was just pure annoying on an Android device because I had some of my longest playlists on that app and the only way to scroll was by swiping up for a long time. Unlike the other two, there is completely no way to sort your playlist’s. You can sort it manually, but no one wants to do that especially with long playlists because that will take hours. I also think Napster’s competition, Apple Music and Spotify, have more music options overall. I think I tend to find more of the less popular available on Apple Music and Spotify more often than Napster, although Napster does seem to have more clean version options than Spotify.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Pros:",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "Easy to scroll through long playlists (IOS)",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Customize playlist covers",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Cons:",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "App is very laggy even on the desktop",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Can’t sort playlists at all",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Scrolling through long playlists is difficult (Android)",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Spotify",
          "indent": false,
          "bold": true,
          "center": true,
          "type": "paragraph"
        },
        {
          "text": "Spotify is probably my favorite out of the four music services. The only things I don’t like about it is its dark interface and that you can only upload playlist covers through the desktop application. Although, I will say that I believe the Android version of the app is better than the IOS one. The Android version can scroll through large playlists easily with a sidebar unlike IOS which you have to do the repetitious scrolling up, and none of its settings are hidden. The latter remark was kind of out of spite because IOS has the capability to sort playlists, it’s just kind of hidden. Idk why they didn’t put it with the rest of the options (the three dots on the top-right. Another thing I love about Spotify is that it connects to devices so that you choose what device to stream on no matter which device you have the app open on so I can control which songs I’m listening to on Spotify through my laptop even if the earbuds I’m using to listen are connected to my phone. Lastly, I don’t know why a music app wouldn’t have a Find in Playlist button, but Spotify seems to be the only one to get that right.",
          "indent": true,
          "type": "paragraph"
        },
        {
          "text": "Pros:",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "Sorts playlists",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Find in playlist",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Customize playlist covers",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Crossfade songs option",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Includes syncronized lyrics",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Easy to scroll through long playlists",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Connects to all devices so that you choose what device to stream on no matter which device you have the app open on.",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Cons:",
          "indent": false,
          "bold": true,
          "type": "paragraph"
        },
        {
          "text": "Does not have song genres",
          "indent": false,
          "type": "li"
        },
        {
          "text": "Permanently dark interface",
          "indent": false,
          "type": "li"
        }
      ]
    }
  ]
}