{
  "main_blog": [
    {
      "id": "birthdays",
      "title": "Birthdays: Why I Hate Them",
      "date": "2018-12-22",
      "img": "https://images.unsplash.com/photo-1530103862676-de8c9debad1d?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1740&q=80",
      "img_position": "0 17%",
      "img_credit": "Adi Goldstein on Unsplash.com",
      "indent": true,
      "content": [
        "Mainly two reasons. One I guess is more negative than the rest (although I guess they could both be considered negative), but I guess what's more important is that they're true. I'm not trying to be negative, it's just how I feel.",
        "First is, they are always hyped up so much. Because of this, you anticipate it to be a really good day for you and so when it doesn't live up to that expectation (which it never does for me), it makes you feel bad about yourself. I understand some people get big celebrations and are really cared for, so their family and friends go all out for them and make it a big day, but I've never had an experience like that and I've never felt special on my birthday. Everyone makes it seem like you're supposed to and that happens for a lot of people, so when that doesn't happen (which it never does for me), it just feels sad and disappointing. I guess every time my birthday comes around, it just reminds of how much I don't matter and how hardly anyone cares about me. Then I just feel sad and depressed the whole day, which makes me angry. Angry that this is my life and that I feel that way on a day that's supposed to be special to me and then just angry that I even have a birthday.",
        "Which brings me to my second reason. A birthday is to celebrate how long you have been alive and I hate being alive. Life sucks and the world we live in sucks and I wish I could just die (like I said, it sounds like I'm just being negative, but it's how I feel). I don't find any reason in celebrating something that sucks. I never feel happy anymore, so what's there to celebrate about my life?",
        "If other people cared more about celebrating me though, maybe I wouldn't feel like life sucks so much and could actually enjoy a birthday for once. But this never happens. So yeah…..birthdays have become a day that I despise. Every time the word “birthday” comes up, there's automatically so much sadness and anger associated with it for me. To try and lessen these feelings on my birthday, I don't attempt to celebrate or even tell people my birthdate anymore. It's just any other day (which it really is). One of the worst feelings is letdown – feeling happy and excited about something, but then things turn out the exact opposite. You feel crushed. When I was young and looked forward to my birthday and invited the few people that I knew over to “celebrate”, it always ended up feeling very underwhelming, especially when comparing it to how other people's birthdays that I know go. So, I'm trying to protect myself from any deeper mental pain. If the date doesn't matter to anyone else, then it shouldn't matter to me either."
      ]
    },
    {
      "id": "i-want-to-say",
      "title": "I want to say...",
      "date": "2020-01-22",
      "img": "https://images.unsplash.com/photo-1516585427167-9f4af9627e6c?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1160&q=80",
      "img_position": "0 40%",
      "img_credit": "Kat J on Unsplash.com",
      "indent": false,
      "content": [
        "I want to say that I feel sad and angry all the time.",
        "I want to say that I feel like I'm not special to anyone. No one needs me, people just use me when they are lonely or bored but don't care about me otherwise.",
        "I want to say that it hurts me knowing that my siblings and all my nieces and nephews will never need me because they never grew up with me. I was never there so they know how to get on without me and it doesn't matter if I'm there now or not.",
        "I want to say that just because even though I never say it verbally and try not to show it, I need you. I hate being ignored or going unnoticed. I need you to see me and act like I matter to you.",
        "I want to say that I want to focus more on my depression than my anxiety because I feel like the anxiety is mostly coming from the depression, not the other way around&hellip;but they are the doctors.",
        "I want to say that I feel sad when you don't answer my texts or respond to my messages. I feel like I'm not that important to you.",
        "I want to say that I really don't know how you can help, but pls don't leave me alone and don't just tell me that you're there for me. I won't take initiative even if it's what I need, and it feels better to know that I'm on someone's mind.",
        "I want to say that I wanna know more about my dad. What he looked like, what his name was. I wanna know how I came about and why.",
        "I want to say that I hate myself and I wish I could be pretty or feel like I fit in and feel wanted and like I belong. I wish I could be good at something other than being a failure.",
        "I want to say that I'm afraid that some of my family secretly hates me because I'm in their life and I wasn't supposed to be. I didn't ask to be here, and I wish I wasn't.",
        "I want to say that God or the higher being of this earth hates me and I think I'm cursed and won't ever be happy. I've just been stuck in this for so long.",
        "I want to say that I don't see a future for myself. If someone asked me where I see myself in five years, my answer is I think I will be dead by then.",
        "I want to say that I'm jealous of you because you have a lot of friends and a lot of people who love to show that they care about you and would never forget you. You are pretty and smart and have people that depend on you, allowing you to be confident. You just fit in in this populous world because of how you grew up and your traits and genetics. You are one of the people that get to be truly blessed. You get to be happy and love life.",
        "I want to say that I don't like to hope anymore because I used to but was always let down and the pain would hurt me harder each time. It's like having the ground pulled out from under you after you feel like you just climbed a lot of stairs, and now, you're below square 1 if it's even possible – it is.",
        "I want to say that I don't feel like your family is my family and maybe that's messed up, but we have nothing in common and I have a whole other family out there who is a lot more like me that I wish I could have grown up with and I miss them. You're my family, but your family isn't. Maybe I'm just lost.",
        "I want to say that I'm sorry that I can't be who I'm supposed to be or who you thought I would be. I'm sorry that I'm not good enough. I'm just not capable. I never was. I know I'm a failure and that I'm disappointing.",
        "I want to say that I've never felt comfortable in my own skin. I've always felt ashamed of myself for being alive and being here or there.",
        "I want to say that I'm scared that I'm gonna be alone and feeling all this sadness, self-hatred and anger forever. I can't even imagine seeing a light in all this darkness anymore because it's been so long and it has never come.",
        "I want to say that I'm sorry for being a bad kid and a bad friend and I wish that I could erase so much.",
        "I want to say that I don't think I can ever love myself if I don't feel like anyone loves me. If I don't deserve other's love, why should I deserve my own? If no one can love me, how can I?",
        "I want to say that I don't know who I am or what I'm doing here. I really have no plans. I'm super lost.", 
        "I want to say that I love people who are genuine and aren't afraid of what people think of them, they are just themselves whatever that is. I never wanna discriminate or leave anyone behind. I don't want anyone to feel how I feel, I wanna uplift people and make them feel comfortable and supported and less judged.",
        "I want to say that I think about you all the time and I wonder if you do the same. But I know you don't.",
        "I want to say thank you for being one of the only ones who have ever noticed me and pls don't ever leave me. I care about that and you more than you know.",
        "I want to say that I wish you needed, appreciated and paid attention to me as much as I do you.",
        "I want to say that I'm scared of people hating me because I'm already so lonely. I'll do anything to be liked and accepted.",
        "I want to say that I want to go to a rage room and let everything out. A lot of the time I just want to punch the wall as hard as I can or throw everything off my desk and yell…but I'm too scared.",
        "I want to say that I feel trapped in everything and I don't think any therapy, counseling or medication can help. I feel helpless and hopeless.",
        "I want to say that I live my life in fear and anxiety. Everything I ever do is out of fear, every decision I make. Idk how to be comfortable because I've never felt like that.",
        "I want to say that I'm adopted, and I feel isolated from other Black people and like they think I don't belong with them. I don't know how to be “black” because I never got to grow up with that experience, but I wish I did.",
        "I want to apologize to all the Black people if they feel like I'm letting them down or like I'm a disappointment.",
        "I want to say that even though I'm gay and quiet and wear boys clothing, I'm still a girl and you can talk to me and trust me, you don't have to treat me like you treat all the guys you know. It hurts when you do things to your other female friends but not to me because I know it means that you see me as different somehow and I'm just insecure but that's all.",
        "I want to say that I cry just about every week and I haven't been happy in a very long time.",
        "I want to say that I feel like I don't deserve to be rid of my depression because I feel like I'm just a bad person who is not supposed to be here. If not, then maybe God or any higher being would be watching over me and guide me to people who I belong with who love me. If I can never fit in and am always alone, then something must be wrong with me that I deserve punishing for.",
        "I want to say that I want to die before you do because I don't want to see you die.",
        "I want to say that I feel like my depression and anxiety are fighting each other and whichever one wins, either way, I lose.",
        "I want to say that I don't want to lose you and that even if I leave here or move somewhere else, I want you to stay in touch with me. I'm not trying to leave you because you're one of the only lights in my life. I just can't stay here feeling like this forever.",
        "I want to say that I don't want to hide things from you because I don't want you to feel like I don't trust you. But idk how I can trust anyone with all this.",
        "I want to say that I'm sorry if you find me annoying. I don't mean to be, I just wanna mind my own business and let you do the same. I don't wanna be a bother.",
        "I want to say that I'm mad at you for leaving me. You used me and then when things got better for you, you left and never came back. Now I never wanna talk to you again bc you hurt me too much and how am I supposed to appreciate you after that? But I guess you don't care if I talk to you or not anyway.",
        "I want to say that I'm not who or what you think I am. I am much weaker. I am sensitive. I am very emotional and think a lot and about too much. I try to please everyone, and I get scared or feel like a failure when I feel like people don't like me or feel like I hurt someone. I can't control my feelings at all or my shyness and anxiety.",
        "I want to say that even though I'm funny and I like to make you laugh doesn't mean that I'm a happy person who is never serious and has no care in the world. Being funny is the only way I know how to get people to notice me because I'm nothing. It masks my insecurities and it also makes me feel good and like people enjoy me when I'm around. But I'm really a mess inside, I'm not laughing when you're gone.",
        "I want to say that I hate life and I hate school and this earth and how the world works. Everything is messed up…some people feast while others starve, and bad things happen to good people and some bad people get away with really messed up things. This world is a horrible place and I wanna leave. I don't feel like I will ever be happy.",
        "I want to say that I want to kill myself. I want to get drunk and jump off a really high building or shoot myself because I don't believe things will ever look up for me. I think suicide is my destiny. I've never been anything my whole life and idk how I could ever be something.", 
        "I want to say that I'm okay with dying and it's what I really want bc I feel like it's the best thing that could happen to me. It's better to me to not be here than to be here always lonely and wishing I could be someone else. It hurts way too much.",
        "I think all this constantly, but don't say it, because I'm scared that if I say anything you will dismiss my feelings or think I'm selfish, foolish or ungrateful of what I do have and not care about how I feel.",
        "I'm scared you consider me as a burden for you and leave me. I don't want to spill everything to someone who is not truly there or doesn't really care.",
        "I'm scared of just getting more hurt. So, I just remain lost and stuck in this endless mess.",
        "I really want to find a way to end my life somehow.",
        "I must."
      ]
    }
  ]
}